zephyrproject-rtos/hal_nxp/dts/nxp/imxrt/imxrt5xx/pinctrl/MIMXRT595SFFOC-pinctrl.h
/*
 * NOTE: File generated by gen_soc_headers.py
 * from MIMXRT595SFFOC/signal_configuration.xml
 *
 * Copyright 2022, 2024 NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MIMXRT595SFFOC_
#define _ZEPHYR_DTS_BINDING_MIMXRT595SFFOC_

#define ADC0_CH0_PIO0_5 IOPCTL_MUX(5, 0)
#define ADC0_CH1_PIO0_12 IOPCTL_MUX(12, 0)
#define ADC0_CH2_PIO0_19 IOPCTL_MUX(19, 0)
#define ADC0_CH8_PIO0_6 IOPCTL_MUX(6, 0)
#define ADC0_CH9_PIO0_13 IOPCTL_MUX(13, 0)
#define CLKIN_PIO0_25 IOPCTL_MUX(25, 7)
#define CLKIN_PIO2_15 IOPCTL_MUX(79, 7)
#define CLKIN_PIO2_30 IOPCTL_MUX(94, 5)
#define CLKIN_PIO4_1 IOPCTL_MUX(129, 7)
#define CLKOUT_PIO0_24 IOPCTL_MUX(24, 7)
#define CLKOUT_PIO1_10 IOPCTL_MUX(42, 7)
#define CLKOUT_PIO2_29 IOPCTL_MUX(93, 5)
#define CLKOUT_PIO4_0 IOPCTL_MUX(128, 7)
#define CMP0_OUT_PIO0_4 IOPCTL_MUX(4, 7)
#define CMP0_OUT_PIO2_30 IOPCTL_MUX(94, 7)
#define CMP0_OUT_PIO3_3 IOPCTL_MUX(99, 7)
#define CTIMER0_CAPTURE0_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER0_CAPTURE0_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER0_CAPTURE0_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER0_CAPTURE0_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER0_CAPTURE0_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER0_CAPTURE0_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER0_CAPTURE0_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER0_CAPTURE0_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER0_CAPTURE0_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER0_CAPTURE0_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER0_CAPTURE0_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER0_CAPTURE0_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER0_CAPTURE0_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER0_CAPTURE0_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER0_CAPTURE0_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER0_CAPTURE0_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER0_CAPTURE1_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER0_CAPTURE1_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER0_CAPTURE1_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER0_CAPTURE1_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER0_CAPTURE1_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER0_CAPTURE1_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER0_CAPTURE1_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER0_CAPTURE1_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER0_CAPTURE1_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER0_CAPTURE1_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER0_CAPTURE1_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER0_CAPTURE1_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER0_CAPTURE1_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER0_CAPTURE1_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER0_CAPTURE1_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER0_CAPTURE1_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER0_CAPTURE2_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER0_CAPTURE2_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER0_CAPTURE2_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER0_CAPTURE2_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER0_CAPTURE2_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER0_CAPTURE2_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER0_CAPTURE2_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER0_CAPTURE2_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER0_CAPTURE2_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER0_CAPTURE2_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER0_CAPTURE2_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER0_CAPTURE2_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER0_CAPTURE2_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER0_CAPTURE2_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER0_CAPTURE2_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER0_CAPTURE2_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER0_CAPTURE3_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER0_CAPTURE3_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER0_CAPTURE3_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER0_CAPTURE3_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER0_CAPTURE3_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER0_CAPTURE3_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER0_CAPTURE3_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER0_CAPTURE3_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER0_CAPTURE3_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER0_CAPTURE3_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER0_CAPTURE3_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER0_CAPTURE3_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER0_CAPTURE3_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER0_CAPTURE3_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER0_CAPTURE3_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER0_CAPTURE3_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER0_MATCH0_PIO0_0 IOPCTL_MUX(0, 4)
#define CTIMER0_MATCH0_PIO0_6 IOPCTL_MUX(6, 4)
#define CTIMER0_MATCH0_PIO3_8 IOPCTL_MUX(104, 4)
#define CTIMER0_MATCH1_PIO0_1 IOPCTL_MUX(1, 4)
#define CTIMER0_MATCH1_PIO0_13 IOPCTL_MUX(13, 4)
#define CTIMER0_MATCH1_PIO3_9 IOPCTL_MUX(105, 4)
#define CTIMER0_MATCH2_PIO0_2 IOPCTL_MUX(2, 4)
#define CTIMER0_MATCH2_PIO3_10 IOPCTL_MUX(106, 4)
#define CTIMER0_MATCH3_PIO0_3 IOPCTL_MUX(3, 4)
#define CTIMER0_MATCH3_PIO3_11 IOPCTL_MUX(107, 4)
#define CTIMER1_CAPTURE0_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER1_CAPTURE0_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER1_CAPTURE0_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER1_CAPTURE0_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER1_CAPTURE0_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER1_CAPTURE0_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER1_CAPTURE0_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER1_CAPTURE0_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER1_CAPTURE0_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER1_CAPTURE0_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER1_CAPTURE0_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER1_CAPTURE0_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER1_CAPTURE0_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER1_CAPTURE0_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER1_CAPTURE0_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER1_CAPTURE0_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER1_CAPTURE1_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER1_CAPTURE1_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER1_CAPTURE1_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER1_CAPTURE1_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER1_CAPTURE1_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER1_CAPTURE1_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER1_CAPTURE1_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER1_CAPTURE1_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER1_CAPTURE1_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER1_CAPTURE1_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER1_CAPTURE1_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER1_CAPTURE1_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER1_CAPTURE1_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER1_CAPTURE1_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER1_CAPTURE1_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER1_CAPTURE1_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER1_CAPTURE2_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER1_CAPTURE2_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER1_CAPTURE2_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER1_CAPTURE2_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER1_CAPTURE2_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER1_CAPTURE2_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER1_CAPTURE2_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER1_CAPTURE2_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER1_CAPTURE2_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER1_CAPTURE2_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER1_CAPTURE2_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER1_CAPTURE2_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER1_CAPTURE2_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER1_CAPTURE2_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER1_CAPTURE2_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER1_CAPTURE2_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER1_CAPTURE3_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER1_CAPTURE3_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER1_CAPTURE3_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER1_CAPTURE3_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER1_CAPTURE3_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER1_CAPTURE3_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER1_CAPTURE3_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER1_CAPTURE3_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER1_CAPTURE3_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER1_CAPTURE3_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER1_CAPTURE3_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER1_CAPTURE3_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER1_CAPTURE3_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER1_CAPTURE3_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER1_CAPTURE3_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER1_CAPTURE3_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER1_MATCH0_PIO0_7 IOPCTL_MUX(7, 4)
#define CTIMER1_MATCH0_PIO2_6 IOPCTL_MUX(70, 4)
#define CTIMER1_MATCH1_PIO0_8 IOPCTL_MUX(8, 4)
#define CTIMER1_MATCH1_PIO2_7 IOPCTL_MUX(71, 4)
#define CTIMER1_MATCH2_PIO0_9 IOPCTL_MUX(9, 4)
#define CTIMER1_MATCH2_PIO2_8 IOPCTL_MUX(72, 4)
#define CTIMER1_MATCH3_PIO0_10 IOPCTL_MUX(10, 4)
#define CTIMER1_MATCH3_PIO2_9 IOPCTL_MUX(73, 4)
#define CTIMER2_CAPTURE0_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER2_CAPTURE0_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER2_CAPTURE0_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER2_CAPTURE0_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER2_CAPTURE0_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER2_CAPTURE0_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER2_CAPTURE0_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER2_CAPTURE0_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER2_CAPTURE0_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER2_CAPTURE0_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER2_CAPTURE0_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER2_CAPTURE0_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER2_CAPTURE0_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER2_CAPTURE0_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER2_CAPTURE0_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER2_CAPTURE0_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER2_CAPTURE1_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER2_CAPTURE1_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER2_CAPTURE1_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER2_CAPTURE1_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER2_CAPTURE1_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER2_CAPTURE1_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER2_CAPTURE1_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER2_CAPTURE1_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER2_CAPTURE1_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER2_CAPTURE1_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER2_CAPTURE1_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER2_CAPTURE1_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER2_CAPTURE1_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER2_CAPTURE1_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER2_CAPTURE1_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER2_CAPTURE1_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER2_CAPTURE2_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER2_CAPTURE2_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER2_CAPTURE2_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER2_CAPTURE2_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER2_CAPTURE2_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER2_CAPTURE2_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER2_CAPTURE2_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER2_CAPTURE2_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER2_CAPTURE2_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER2_CAPTURE2_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER2_CAPTURE2_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER2_CAPTURE2_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER2_CAPTURE2_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER2_CAPTURE2_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER2_CAPTURE2_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER2_CAPTURE2_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER2_CAPTURE3_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER2_CAPTURE3_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER2_CAPTURE3_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER2_CAPTURE3_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER2_CAPTURE3_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER2_CAPTURE3_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER2_CAPTURE3_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER2_CAPTURE3_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER2_CAPTURE3_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER2_CAPTURE3_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER2_CAPTURE3_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER2_CAPTURE3_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER2_CAPTURE3_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER2_CAPTURE3_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER2_CAPTURE3_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER2_CAPTURE3_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER2_MATCH0_PIO0_14 IOPCTL_MUX(14, 4)
#define CTIMER2_MATCH0_PIO1_11 IOPCTL_MUX(43, 4)
#define CTIMER2_MATCH0_PIO2_10 IOPCTL_MUX(74, 4)
#define CTIMER2_MATCH1_PIO0_15 IOPCTL_MUX(15, 4)
#define CTIMER2_MATCH1_PIO1_12 IOPCTL_MUX(44, 4)
#define CTIMER2_MATCH1_PIO2_11 IOPCTL_MUX(75, 4)
#define CTIMER2_MATCH2_PIO0_16 IOPCTL_MUX(16, 4)
#define CTIMER2_MATCH2_PIO1_13 IOPCTL_MUX(45, 4)
#define CTIMER2_MATCH3_PIO0_17 IOPCTL_MUX(17, 4)
#define CTIMER2_MATCH3_PIO1_14 IOPCTL_MUX(46, 4)
#define CTIMER3_CAPTURE0_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER3_CAPTURE0_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER3_CAPTURE0_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER3_CAPTURE0_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER3_CAPTURE0_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER3_CAPTURE0_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER3_CAPTURE0_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER3_CAPTURE0_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER3_CAPTURE0_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER3_CAPTURE0_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER3_CAPTURE0_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER3_CAPTURE0_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER3_CAPTURE0_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER3_CAPTURE0_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER3_CAPTURE0_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER3_CAPTURE0_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER3_CAPTURE1_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER3_CAPTURE1_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER3_CAPTURE1_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER3_CAPTURE1_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER3_CAPTURE1_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER3_CAPTURE1_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER3_CAPTURE1_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER3_CAPTURE1_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER3_CAPTURE1_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER3_CAPTURE1_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER3_CAPTURE1_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER3_CAPTURE1_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER3_CAPTURE1_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER3_CAPTURE1_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER3_CAPTURE1_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER3_CAPTURE1_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER3_CAPTURE2_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER3_CAPTURE2_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER3_CAPTURE2_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER3_CAPTURE2_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER3_CAPTURE2_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER3_CAPTURE2_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER3_CAPTURE2_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER3_CAPTURE2_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER3_CAPTURE2_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER3_CAPTURE2_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER3_CAPTURE2_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER3_CAPTURE2_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER3_CAPTURE2_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER3_CAPTURE2_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER3_CAPTURE2_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER3_CAPTURE2_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER3_CAPTURE3_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER3_CAPTURE3_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER3_CAPTURE3_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER3_CAPTURE3_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER3_CAPTURE3_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER3_CAPTURE3_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER3_CAPTURE3_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER3_CAPTURE3_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER3_CAPTURE3_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER3_CAPTURE3_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER3_CAPTURE3_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER3_CAPTURE3_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER3_CAPTURE3_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER3_CAPTURE3_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER3_CAPTURE3_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER3_CAPTURE3_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER3_MATCH0_PIO0_21 IOPCTL_MUX(21, 4)
#define CTIMER3_MATCH0_PIO1_15 IOPCTL_MUX(47, 4)
#define CTIMER3_MATCH0_PIO3_14 IOPCTL_MUX(110, 4)
#define CTIMER3_MATCH1_PIO0_22 IOPCTL_MUX(22, 4)
#define CTIMER3_MATCH1_PIO3_15 IOPCTL_MUX(111, 4)
#define CTIMER3_MATCH2_PIO0_23 IOPCTL_MUX(23, 4)
#define CTIMER3_MATCH2_PIO3_16 IOPCTL_MUX(112, 4)
#define CTIMER3_MATCH3_PIO0_24 IOPCTL_MUX(24, 4)
#define CTIMER3_MATCH3_PIO1_18 IOPCTL_MUX(50, 4)
#define CTIMER3_MATCH3_PIO3_17 IOPCTL_MUX(113, 4)
#define CTIMER4_CAPTURE0_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER4_CAPTURE0_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER4_CAPTURE0_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER4_CAPTURE0_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER4_CAPTURE0_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER4_CAPTURE0_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER4_CAPTURE0_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER4_CAPTURE0_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER4_CAPTURE0_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER4_CAPTURE0_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER4_CAPTURE0_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER4_CAPTURE0_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER4_CAPTURE0_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER4_CAPTURE0_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER4_CAPTURE0_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER4_CAPTURE0_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER4_CAPTURE1_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER4_CAPTURE1_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER4_CAPTURE1_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER4_CAPTURE1_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER4_CAPTURE1_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER4_CAPTURE1_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER4_CAPTURE1_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER4_CAPTURE1_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER4_CAPTURE1_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER4_CAPTURE1_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER4_CAPTURE1_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER4_CAPTURE1_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER4_CAPTURE1_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER4_CAPTURE1_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER4_CAPTURE1_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER4_CAPTURE1_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER4_CAPTURE2_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER4_CAPTURE2_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER4_CAPTURE2_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER4_CAPTURE2_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER4_CAPTURE2_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER4_CAPTURE2_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER4_CAPTURE2_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER4_CAPTURE2_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER4_CAPTURE2_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER4_CAPTURE2_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER4_CAPTURE2_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER4_CAPTURE2_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER4_CAPTURE2_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER4_CAPTURE2_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER4_CAPTURE2_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER4_CAPTURE2_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER4_CAPTURE3_PIO0_11 IOPCTL_MUX(11, 4)
#define CTIMER4_CAPTURE3_PIO0_12 IOPCTL_MUX(12, 4)
#define CTIMER4_CAPTURE3_PIO0_18 IOPCTL_MUX(18, 4)
#define CTIMER4_CAPTURE3_PIO0_19 IOPCTL_MUX(19, 4)
#define CTIMER4_CAPTURE3_PIO0_25 IOPCTL_MUX(25, 4)
#define CTIMER4_CAPTURE3_PIO0_4 IOPCTL_MUX(4, 4)
#define CTIMER4_CAPTURE3_PIO0_5 IOPCTL_MUX(5, 4)
#define CTIMER4_CAPTURE3_PIO1_0 IOPCTL_MUX(32, 4)
#define CTIMER4_CAPTURE3_PIO1_10 IOPCTL_MUX(42, 4)
#define CTIMER4_CAPTURE3_PIO1_23 IOPCTL_MUX(55, 4)
#define CTIMER4_CAPTURE3_PIO1_29 IOPCTL_MUX(61, 4)
#define CTIMER4_CAPTURE3_PIO1_7 IOPCTL_MUX(39, 4)
#define CTIMER4_CAPTURE3_PIO2_14 IOPCTL_MUX(78, 4)
#define CTIMER4_CAPTURE3_PIO2_31 IOPCTL_MUX(95, 4)
#define CTIMER4_CAPTURE3_PIO3_12 IOPCTL_MUX(108, 4)
#define CTIMER4_CAPTURE3_PIO3_13 IOPCTL_MUX(109, 4)
#define CTIMER4_MATCH0_PIO0_28 IOPCTL_MUX(28, 4)
#define CTIMER4_MATCH0_PIO1_19 IOPCTL_MUX(51, 4)
#define CTIMER4_MATCH0_PIO3_18 IOPCTL_MUX(114, 4)
#define CTIMER4_MATCH1_PIO0_29 IOPCTL_MUX(29, 4)
#define CTIMER4_MATCH1_PIO1_20 IOPCTL_MUX(52, 4)
#define CTIMER4_MATCH1_PIO3_19 IOPCTL_MUX(115, 4)
#define CTIMER4_MATCH2_PIO0_30 IOPCTL_MUX(30, 4)
#define CTIMER4_MATCH2_PIO1_21 IOPCTL_MUX(53, 4)
#define CTIMER4_MATCH2_PIO3_20 IOPCTL_MUX(116, 4)
#define CTIMER4_MATCH3_PIO0_31 IOPCTL_MUX(31, 4)
#define CTIMER4_MATCH3_PIO1_22 IOPCTL_MUX(54, 4)
#define CTIMER4_MATCH3_PIO3_21 IOPCTL_MUX(117, 4)
#define DMA0_TRIG0_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA0_TRIG0_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA0_TRIG0_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA0_TRIG0_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA0_TRIG0_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA0_TRIG0_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA0_TRIG0_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA0_TRIG0_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA0_TRIG0_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA0_TRIG0_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA0_TRIG0_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA0_TRIG0_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA0_TRIG0_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA0_TRIG0_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA0_TRIG0_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA0_TRIG0_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA0_TRIG0_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA0_TRIG0_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA0_TRIG0_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA0_TRIG0_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA0_TRIG0_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA0_TRIG0_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA0_TRIG0_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA0_TRIG0_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA0_TRIG0_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA0_TRIG0_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA0_TRIG0_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA0_TRIG0_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA0_TRIG0_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA0_TRIG0_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA0_TRIG0_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA0_TRIG0_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA0_TRIG0_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA0_TRIG0_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA0_TRIG0_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA0_TRIG0_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA0_TRIG0_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA0_TRIG0_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA0_TRIG0_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA0_TRIG0_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA0_TRIG0_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA0_TRIG0_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA0_TRIG0_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA0_TRIG0_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA0_TRIG0_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA0_TRIG0_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA0_TRIG0_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA0_TRIG0_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA0_TRIG0_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA0_TRIG0_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA0_TRIG0_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA0_TRIG0_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA0_TRIG0_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA0_TRIG0_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA0_TRIG0_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA0_TRIG10_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA0_TRIG10_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA0_TRIG10_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA0_TRIG10_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA0_TRIG10_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA0_TRIG10_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA0_TRIG10_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA0_TRIG10_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA0_TRIG10_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA0_TRIG10_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA0_TRIG10_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA0_TRIG10_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA0_TRIG10_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA0_TRIG10_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA0_TRIG10_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA0_TRIG10_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA0_TRIG10_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA0_TRIG10_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA0_TRIG10_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA0_TRIG10_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA0_TRIG10_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA0_TRIG10_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA0_TRIG10_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA0_TRIG10_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA0_TRIG10_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA0_TRIG10_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA0_TRIG10_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA0_TRIG10_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA0_TRIG10_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA0_TRIG10_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA0_TRIG10_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA0_TRIG10_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA0_TRIG10_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA0_TRIG10_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA0_TRIG10_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA0_TRIG10_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA0_TRIG10_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA0_TRIG10_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA0_TRIG10_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA0_TRIG10_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA0_TRIG10_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA0_TRIG10_PIO1_23 IOPCTL_MUX(55, 0)
