zephyrproject-rtos/hal_nxp/dts/nxp/imxrt/imxrt5xx/pinctrl/MIMXRT595SFFOC-pinctrl.h
#define DMA1_TRIG16_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG16_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG16_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG16_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG16_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG16_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG16_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG16_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG16_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG16_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG16_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG16_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG16_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG16_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG16_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG16_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG16_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG16_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG16_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG16_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG16_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG16_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG16_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG16_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG16_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG16_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG16_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG16_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG16_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG16_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG16_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG16_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG16_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG16_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG16_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG16_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG16_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG16_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG16_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG17_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG17_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG17_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG17_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG17_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG17_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG17_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG17_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG17_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG17_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG17_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG17_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG17_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG17_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG17_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG17_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG17_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG17_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG17_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG17_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG17_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG17_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG17_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG17_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG17_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG17_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG17_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG17_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG17_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG17_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG17_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG17_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG17_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG17_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG17_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG17_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG17_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG17_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG17_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG17_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG17_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG17_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG17_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG17_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG17_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG17_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG17_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG17_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG17_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG17_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG17_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG17_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG17_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG17_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG17_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG18_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG18_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG18_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG18_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG18_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG18_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG18_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG18_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG18_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG18_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG18_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG18_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG18_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG18_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG18_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG18_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG18_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG18_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG18_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG18_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG18_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG18_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG18_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG18_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG18_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG18_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG18_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG18_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG18_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG18_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG18_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG18_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG18_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG18_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG18_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG18_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG18_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG18_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG18_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG18_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG18_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG18_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG18_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG18_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG18_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG18_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG18_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG18_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG18_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG18_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG18_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG18_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG18_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG18_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG18_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG19_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG19_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG19_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG19_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG19_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG19_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG19_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG19_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG19_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG19_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG19_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG19_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG19_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG19_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG19_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG19_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG19_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG19_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG19_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG19_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG19_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG19_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG19_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG19_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG19_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG19_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG19_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG19_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG19_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG19_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG19_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG19_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG19_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG19_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG19_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG19_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG19_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG19_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG19_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG19_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG19_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG19_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG19_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG19_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG19_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG19_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG19_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG19_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG19_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG19_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG19_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG19_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG19_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG19_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG19_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG1_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG1_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG1_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG1_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG1_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG1_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG1_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG1_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG1_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG1_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG1_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG1_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG1_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG1_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG1_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG1_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG1_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG1_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG1_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG1_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG1_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG1_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG1_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG1_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG1_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG1_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG1_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG1_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG1_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG1_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG1_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG1_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG1_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG1_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG1_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG1_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG1_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG1_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG1_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG1_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG1_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG1_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG1_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG1_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG1_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG1_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG1_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG1_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG1_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG1_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG1_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG1_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG1_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG1_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG1_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG20_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG20_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG20_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG20_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG20_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG20_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG20_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG20_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG20_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG20_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG20_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG20_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG20_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG20_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG20_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG20_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG20_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG20_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG20_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG20_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG20_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG20_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG20_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG20_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG20_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG20_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG20_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG20_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG20_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG20_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG20_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG20_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG20_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG20_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG20_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG20_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG20_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG20_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG20_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG20_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG20_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG20_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG20_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG20_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG20_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG20_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG20_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG20_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG20_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG20_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG20_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG20_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG20_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG20_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG20_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG21_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG21_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG21_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG21_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG21_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG21_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG21_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG21_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG21_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG21_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG21_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG21_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG21_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG21_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG21_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG21_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG21_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG21_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG21_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG21_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG21_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG21_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG21_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG21_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG21_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG21_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG21_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG21_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG21_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG21_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG21_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG21_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG21_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG21_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG21_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG21_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG21_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG21_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG21_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG21_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG21_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG21_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG21_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG21_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG21_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG21_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG21_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG21_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG21_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG21_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG21_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG21_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG21_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG21_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG21_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG22_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG22_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG22_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG22_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG22_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG22_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG22_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG22_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG22_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG22_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG22_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG22_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG22_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG22_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG22_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG22_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG22_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG22_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG22_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG22_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG22_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG22_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG22_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG22_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG22_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG22_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG22_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG22_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG22_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG22_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG22_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG22_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG22_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG22_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG22_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG22_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG22_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG22_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG22_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG22_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG22_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG22_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG22_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG22_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG22_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG22_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG22_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG22_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG22_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG22_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG22_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG22_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG22_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG22_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG22_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG23_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG23_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG23_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG23_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG23_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG23_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG23_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG23_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG23_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG23_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG23_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG23_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG23_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG23_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG23_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG23_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG23_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG23_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG23_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG23_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG23_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG23_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG23_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG23_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG23_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG23_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG23_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG23_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG23_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG23_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG23_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG23_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG23_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG23_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG23_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG23_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG23_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG23_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG23_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG23_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG23_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG23_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG23_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG23_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG23_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG23_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG23_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG23_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG23_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG23_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG23_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG23_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG23_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG23_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG23_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG24_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG24_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG24_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG24_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG24_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG24_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG24_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG24_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG24_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG24_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG24_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG24_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG24_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG24_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG24_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG24_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG24_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG24_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG24_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG24_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG24_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG24_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG24_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG24_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG24_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG24_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG24_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG24_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG24_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG24_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG24_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG24_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG24_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG24_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG24_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG24_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG24_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG24_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG24_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG24_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG24_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG24_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG24_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG24_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG24_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG24_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG24_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG24_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG24_PIO1_3 IOPCTL_MUX(35, 0)
