zephyrproject-rtos/hal_nxp/dts/nxp/imxrt/imxrt5xx/pinctrl/MIMXRT595SFFOC-pinctrl.h
#define DMA1_TRIG3_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG3_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG3_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG3_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG3_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG3_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG3_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG3_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG3_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG3_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG3_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG3_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG3_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG3_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG3_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG3_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG3_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG3_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG3_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG3_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG3_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG3_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG3_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG3_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG3_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG3_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG3_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG4_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG4_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG4_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG4_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG4_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG4_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG4_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG4_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG4_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG4_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG4_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG4_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG4_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG4_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG4_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG4_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG4_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG4_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG4_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG4_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG4_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG4_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG4_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG4_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG4_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG4_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG4_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG4_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG4_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG4_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG4_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG4_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG4_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG4_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG4_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG4_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG4_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG4_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG4_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG4_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG4_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG4_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG4_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG4_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG4_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG4_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG4_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG4_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG4_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG4_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG4_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG4_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG4_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG4_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG4_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG5_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG5_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG5_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG5_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG5_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG5_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG5_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG5_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG5_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG5_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG5_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG5_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG5_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG5_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG5_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG5_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG5_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG5_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG5_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG5_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG5_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG5_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG5_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG5_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG5_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG5_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG5_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG5_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG5_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG5_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG5_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG5_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG5_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG5_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG5_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG5_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG5_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG5_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG5_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG5_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG5_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG5_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG5_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG5_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG5_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG5_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG5_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG5_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG5_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG5_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG5_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG5_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG5_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG5_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG5_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG6_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG6_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG6_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG6_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG6_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG6_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG6_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG6_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG6_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG6_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG6_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG6_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG6_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG6_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG6_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG6_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG6_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG6_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG6_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG6_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG6_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG6_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG6_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG6_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG6_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG6_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG6_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG6_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG6_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG6_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG6_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG6_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG6_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG6_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG6_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG6_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG6_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG6_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG6_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG6_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG6_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG6_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG6_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG6_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG6_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG6_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG6_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG6_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG6_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG6_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG6_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG6_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG6_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG6_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG6_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG7_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG7_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG7_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG7_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG7_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG7_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG7_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG7_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG7_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG7_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG7_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG7_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG7_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG7_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG7_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG7_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG7_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG7_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG7_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG7_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG7_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG7_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG7_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG7_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG7_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG7_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG7_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG7_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG7_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG7_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG7_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG7_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG7_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG7_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG7_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG7_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG7_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG7_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG7_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG7_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG7_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG7_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG7_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG7_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG7_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG7_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG7_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG7_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG7_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG7_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG7_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG7_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG7_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG7_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG7_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG8_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG8_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG8_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG8_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG8_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG8_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG8_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG8_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG8_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG8_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG8_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG8_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG8_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG8_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG8_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG8_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG8_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG8_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG8_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG8_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG8_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG8_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG8_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG8_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG8_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG8_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG8_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG8_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG8_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG8_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG8_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG8_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG8_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG8_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG8_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG8_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG8_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG8_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG8_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG8_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG8_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG8_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG8_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG8_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG8_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG8_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG8_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG8_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG8_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG8_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG8_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG8_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG8_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG8_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG8_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG9_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG9_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG9_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG9_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG9_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG9_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG9_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG9_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG9_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG9_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG9_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG9_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG9_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG9_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG9_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG9_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG9_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG9_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG9_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG9_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG9_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG9_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG9_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG9_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG9_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG9_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG9_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG9_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG9_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG9_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG9_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG9_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG9_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG9_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG9_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG9_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG9_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG9_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG9_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG9_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG9_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG9_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG9_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG9_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG9_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG9_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG9_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG9_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG9_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG9_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG9_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG9_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG9_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG9_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG9_PIO1_7 IOPCTL_MUX(39, 0)
#define FC0_CTS_SDA_SSEL0_PIO0_3 IOPCTL_MUX(3, 1)
#define FC0_CTS_SDA_SSEL0_PIO3_3 IOPCTL_MUX(99, 5)
#define FC0_RTS_SCL_SSEL1_PIO0_4 IOPCTL_MUX(4, 1)
#define FC0_RXD_SDA_MOSI_DATA_PIO0_2 IOPCTL_MUX(2, 1)
#define FC0_RXD_SDA_MOSI_DATA_PIO3_2 IOPCTL_MUX(98, 5)
#define FC0_SCK_PIO0_0 IOPCTL_MUX(0, 1)
#define FC0_SSEL2_PIO0_10 IOPCTL_MUX(10, 5)
#define FC0_SSEL2_PIO0_5 IOPCTL_MUX(5, 1)
#define FC0_SSEL3_PIO0_11 IOPCTL_MUX(11, 5)
#define FC0_SSEL3_PIO0_6 IOPCTL_MUX(6, 1)
#define FC0_TXD_SCL_MISO_WS_PIO0_1 IOPCTL_MUX(1, 1)
#define FC0_TXD_SCL_MISO_WS_PIO3_1 IOPCTL_MUX(97, 5)
#define FC1_CTS_SDA_SSEL0_PIO0_10 IOPCTL_MUX(10, 1)
#define FC1_RTS_SCL_SSEL1_PIO0_11 IOPCTL_MUX(11, 1)
#define FC1_RXD_SDA_MOSI_DATA_PIO0_9 IOPCTL_MUX(9, 1)
#define FC1_SCK_PIO0_7 IOPCTL_MUX(7, 1)
#define FC1_SSEL2_PIO0_12 IOPCTL_MUX(12, 1)
#define FC1_SSEL2_PIO0_3 IOPCTL_MUX(3, 5)
#define FC1_SSEL3_PIO0_13 IOPCTL_MUX(13, 1)
#define FC1_SSEL3_PIO0_4 IOPCTL_MUX(4, 5)
#define FC1_TXD_SCL_MISO_WS_PIO0_8 IOPCTL_MUX(8, 1)
#define FC2_CTS_SDA_SSEL0_PIO0_17 IOPCTL_MUX(17, 1)
#define FC2_RTS_SCL_SSEL1_PIO0_18 IOPCTL_MUX(18, 1)
#define FC2_RXD_SDA_MOSI_DATA_PIO0_16 IOPCTL_MUX(16, 1)
#define FC2_SCK_PIO0_14 IOPCTL_MUX(14, 1)
#define FC2_SSEL2_PIO0_19 IOPCTL_MUX(19, 1)
#define FC2_SSEL2_PIO0_24 IOPCTL_MUX(24, 5)
#define FC2_SSEL3_PIO0_25 IOPCTL_MUX(25, 5)
#define FC2_TXD_SCL_MISO_WS_PIO0_15 IOPCTL_MUX(15, 1)
#define FC3_CTS_SDA_SSEL0_PIO0_24 IOPCTL_MUX(24, 1)
#define FC3_RTS_SCL_SSEL1_PIO0_25 IOPCTL_MUX(25, 1)
#define FC3_RXD_SDA_MOSI_DATA_PIO0_23 IOPCTL_MUX(23, 1)
#define FC3_SCK_PIO0_21 IOPCTL_MUX(21, 1)
#define FC3_SSEL2_PIO0_31 IOPCTL_MUX(31, 5)
#define FC3_SSEL3_PIO1_0 IOPCTL_MUX(32, 5)
#define FC3_TXD_SCL_MISO_WS_PIO0_22 IOPCTL_MUX(22, 1)
#define FC4_CTS_SDA_SSEL0_PIO0_31 IOPCTL_MUX(31, 1)
#define FC4_RTS_SCL_SSEL1_PIO1_0 IOPCTL_MUX(32, 1)
#define FC4_RXD_SDA_MOSI_DATA_PIO0_30 IOPCTL_MUX(30, 1)
#define FC4_SCK_PIO0_28 IOPCTL_MUX(28, 1)
#define FC4_SSEL2_PIO1_6 IOPCTL_MUX(38, 5)
#define FC4_SSEL3_PIO1_7 IOPCTL_MUX(39, 5)
#define FC4_TXD_SCL_MISO_WS_PIO0_29 IOPCTL_MUX(29, 1)
#define FC5_CTS_SDA_SSEL0_PIO1_6 IOPCTL_MUX(38, 1)
#define FC5_CTS_SDA_SSEL0_PIO3_18 IOPCTL_MUX(114, 5)
#define FC5_RTS_SCL_SSEL1_PIO1_7 IOPCTL_MUX(39, 1)
#define FC5_RXD_SDA_MOSI_DATA_PIO1_5 IOPCTL_MUX(37, 1)
#define FC5_RXD_SDA_MOSI_DATA_PIO3_17 IOPCTL_MUX(113, 5)
#define FC5_SCK_PIO1_3 IOPCTL_MUX(35, 1)
#define FC5_SCK_PIO3_15 IOPCTL_MUX(111, 5)
#define FC5_SSEL2_PIO0_17 IOPCTL_MUX(17, 5)
#define FC5_SSEL3_PIO0_18 IOPCTL_MUX(18, 5)
#define FC5_TXD_SCL_MISO_WS_PIO1_4 IOPCTL_MUX(36, 1)
#define FC5_TXD_SCL_MISO_WS_PIO3_16 IOPCTL_MUX(112, 5)
#define FC6_CTS_SDA_SSEL0_PIO3_28 IOPCTL_MUX(124, 1)
#define FC6_RTS_SCL_SSEL1_PIO3_29 IOPCTL_MUX(125, 1)
#define FC6_RXD_SDA_MOSI_DATA_PIO3_27 IOPCTL_MUX(123, 1)
#define FC6_SCK_PIO3_25 IOPCTL_MUX(121, 1)
#define FC6_TXD_SCL_MISO_WS_PIO3_26 IOPCTL_MUX(122, 1)
#define FC7_CTS_SDA_SSEL0_PIO4_3 IOPCTL_MUX(131, 1)
#define FC7_RTS_SCL_SSEL1_PIO4_4 IOPCTL_MUX(132, 1)
#define FC7_RXD_SDA_MOSI_DATA_PIO4_2 IOPCTL_MUX(130, 1)
#define FC7_SCK_PIO4_0 IOPCTL_MUX(128, 1)
#define FC7_SSEL2_PIO4_5 IOPCTL_MUX(133, 1)
#define FC7_SSEL3_PIO4_6 IOPCTL_MUX(134, 1)
#define FC7_TXD_SCL_MISO_WS_PIO4_1 IOPCTL_MUX(129, 1)
#define FREQME_IN0_PIO0_25 IOPCTL_MUX(25, 3)
#define FREQME_IN0_PIO1_10 IOPCTL_MUX(42, 3)
#define FREQME_IN0_PIO4_0 IOPCTL_MUX(128, 4)
#define FREQME_IN1_PIO0_25 IOPCTL_MUX(25, 3)
#define FREQME_IN1_PIO1_10 IOPCTL_MUX(42, 3)
#define FREQME_IN1_PIO4_0 IOPCTL_MUX(128, 4)
#define GPIO_INT_BMAT_PIO0_0 IOPCTL_MUX(0, 6)
#define GPIO_INT_BMAT_PIO2_24 IOPCTL_MUX(88, 6)
#define GPIO_INT_BMAT_PIO3_21 IOPCTL_MUX(117, 6)
#define GPIO_PIO00_PIO0_0 IOPCTL_MUX(0, 0)
#define GPIO_PIO010_PIO0_10 IOPCTL_MUX(10, 0)
#define GPIO_PIO011_PIO0_11 IOPCTL_MUX(11, 0)
#define GPIO_PIO012_PIO0_12 IOPCTL_MUX(12, 0)
#define GPIO_PIO013_PIO0_13 IOPCTL_MUX(13, 0)
#define GPIO_PIO014_PIO0_14 IOPCTL_MUX(14, 0)
#define GPIO_PIO015_PIO0_15 IOPCTL_MUX(15, 0)
#define GPIO_PIO016_PIO0_16 IOPCTL_MUX(16, 0)
#define GPIO_PIO017_PIO0_17 IOPCTL_MUX(17, 0)
#define GPIO_PIO018_PIO0_18 IOPCTL_MUX(18, 0)
#define GPIO_PIO019_PIO0_19 IOPCTL_MUX(19, 0)
#define GPIO_PIO01_PIO0_1 IOPCTL_MUX(1, 0)
#define GPIO_PIO021_PIO0_21 IOPCTL_MUX(21, 0)
#define GPIO_PIO022_PIO0_22 IOPCTL_MUX(22, 0)
#define GPIO_PIO023_PIO0_23 IOPCTL_MUX(23, 0)
#define GPIO_PIO024_PIO0_24 IOPCTL_MUX(24, 0)
#define GPIO_PIO025_PIO0_25 IOPCTL_MUX(25, 0)
#define GPIO_PIO028_PIO0_28 IOPCTL_MUX(28, 0)
#define GPIO_PIO029_PIO0_29 IOPCTL_MUX(29, 0)
#define GPIO_PIO02_PIO0_2 IOPCTL_MUX(2, 0)
#define GPIO_PIO030_PIO0_30 IOPCTL_MUX(30, 0)
#define GPIO_PIO031_PIO0_31 IOPCTL_MUX(31, 0)
#define GPIO_PIO03_PIO0_3 IOPCTL_MUX(3, 0)
#define GPIO_PIO04_PIO0_4 IOPCTL_MUX(4, 0)
#define GPIO_PIO05_PIO0_5 IOPCTL_MUX(5, 0)
#define GPIO_PIO06_PIO0_6 IOPCTL_MUX(6, 0)
#define GPIO_PIO07_PIO0_7 IOPCTL_MUX(7, 0)
#define GPIO_PIO08_PIO0_8 IOPCTL_MUX(8, 0)
#define GPIO_PIO09_PIO0_9 IOPCTL_MUX(9, 0)
#define GPIO_PIO10_PIO1_0 IOPCTL_MUX(32, 0)
#define GPIO_PIO110_PIO1_10 IOPCTL_MUX(42, 0)
#define GPIO_PIO111_PIO1_11 IOPCTL_MUX(43, 0)
#define GPIO_PIO112_PIO1_12 IOPCTL_MUX(44, 0)
#define GPIO_PIO113_PIO1_13 IOPCTL_MUX(45, 0)
#define GPIO_PIO114_PIO1_14 IOPCTL_MUX(46, 0)
#define GPIO_PIO115_PIO1_15 IOPCTL_MUX(47, 0)
#define GPIO_PIO118_PIO1_18 IOPCTL_MUX(50, 0)
#define GPIO_PIO119_PIO1_19 IOPCTL_MUX(51, 0)
#define GPIO_PIO120_PIO1_20 IOPCTL_MUX(52, 0)
#define GPIO_PIO121_PIO1_21 IOPCTL_MUX(53, 0)
#define GPIO_PIO122_PIO1_22 IOPCTL_MUX(54, 0)
#define GPIO_PIO123_PIO1_23 IOPCTL_MUX(55, 0)
#define GPIO_PIO124_PIO1_24 IOPCTL_MUX(56, 0)
#define GPIO_PIO125_PIO1_25 IOPCTL_MUX(57, 0)
#define GPIO_PIO126_PIO1_26 IOPCTL_MUX(58, 0)
#define GPIO_PIO127_PIO1_27 IOPCTL_MUX(59, 0)
#define GPIO_PIO128_PIO1_28 IOPCTL_MUX(60, 0)
#define GPIO_PIO129_PIO1_29 IOPCTL_MUX(61, 0)
#define GPIO_PIO130_PIO1_30 IOPCTL_MUX(62, 0)
#define GPIO_PIO131_PIO1_31 IOPCTL_MUX(63, 0)
#define GPIO_PIO13_PIO1_3 IOPCTL_MUX(35, 0)
#define GPIO_PIO14_PIO1_4 IOPCTL_MUX(36, 0)
#define GPIO_PIO15_PIO1_5 IOPCTL_MUX(37, 0)
#define GPIO_PIO16_PIO1_6 IOPCTL_MUX(38, 0)
#define GPIO_PIO17_PIO1_7 IOPCTL_MUX(39, 0)
#define GPIO_PIO20_PIO2_0 IOPCTL_MUX(64, 0)
#define GPIO_PIO210_PIO2_10 IOPCTL_MUX(74, 0)
#define GPIO_PIO211_PIO2_11 IOPCTL_MUX(75, 0)
#define GPIO_PIO214_PIO2_14 IOPCTL_MUX(78, 0)
#define GPIO_PIO215_PIO2_15 IOPCTL_MUX(79, 0)
#define GPIO_PIO21_PIO2_1 IOPCTL_MUX(65, 0)
#define GPIO_PIO224_PIO2_24 IOPCTL_MUX(88, 0)
#define GPIO_PIO225_PIO2_25 IOPCTL_MUX(89, 0)
#define GPIO_PIO226_PIO2_26 IOPCTL_MUX(90, 0)
#define GPIO_PIO227_PIO2_27 IOPCTL_MUX(91, 0)
#define GPIO_PIO228_PIO2_28 IOPCTL_MUX(92, 0)
#define GPIO_PIO229_PIO2_29 IOPCTL_MUX(93, 0)
#define GPIO_PIO22_PIO2_2 IOPCTL_MUX(66, 0)
#define GPIO_PIO230_PIO2_30 IOPCTL_MUX(94, 0)
#define GPIO_PIO231_PIO2_31 IOPCTL_MUX(95, 0)
#define GPIO_PIO23_PIO2_3 IOPCTL_MUX(67, 0)
#define GPIO_PIO24_PIO2_4 IOPCTL_MUX(68, 0)
#define GPIO_PIO25_PIO2_5 IOPCTL_MUX(69, 0)
#define GPIO_PIO26_PIO2_6 IOPCTL_MUX(70, 0)
#define GPIO_PIO27_PIO2_7 IOPCTL_MUX(71, 0)
#define GPIO_PIO28_PIO2_8 IOPCTL_MUX(72, 0)
#define GPIO_PIO29_PIO2_9 IOPCTL_MUX(73, 0)
#define GPIO_PIO310_PIO3_10 IOPCTL_MUX(106, 0)
#define GPIO_PIO311_PIO3_11 IOPCTL_MUX(107, 0)
#define GPIO_PIO312_PIO3_12 IOPCTL_MUX(108, 0)
#define GPIO_PIO313_PIO3_13 IOPCTL_MUX(109, 0)
#define GPIO_PIO314_PIO3_14 IOPCTL_MUX(110, 0)
#define GPIO_PIO315_PIO3_15 IOPCTL_MUX(111, 0)
#define GPIO_PIO316_PIO3_16 IOPCTL_MUX(112, 0)
#define GPIO_PIO317_PIO3_17 IOPCTL_MUX(113, 0)
#define GPIO_PIO318_PIO3_18 IOPCTL_MUX(114, 0)
#define GPIO_PIO319_PIO3_19 IOPCTL_MUX(115, 0)
#define GPIO_PIO31_PIO3_1 IOPCTL_MUX(97, 0)
#define GPIO_PIO320_PIO3_20 IOPCTL_MUX(116, 0)
#define GPIO_PIO321_PIO3_21 IOPCTL_MUX(117, 0)
#define GPIO_PIO325_PIO3_25 IOPCTL_MUX(121, 0)
#define GPIO_PIO326_PIO3_26 IOPCTL_MUX(122, 0)
#define GPIO_PIO327_PIO3_27 IOPCTL_MUX(123, 0)
#define GPIO_PIO328_PIO3_28 IOPCTL_MUX(124, 0)
#define GPIO_PIO329_PIO3_29 IOPCTL_MUX(125, 0)
#define GPIO_PIO32_PIO3_2 IOPCTL_MUX(98, 0)
#define GPIO_PIO33_PIO3_3 IOPCTL_MUX(99, 0)
#define GPIO_PIO38_PIO3_8 IOPCTL_MUX(104, 0)
