zephyrproject-rtos/hal_nxp/dts/nxp/imxrt/imxrt5xx/pinctrl/MIMXRT595SFFOC-pinctrl.h
#define GPIO_PIO39_PIO3_9 IOPCTL_MUX(105, 0)
#define GPIO_PIO40_PIO4_0 IOPCTL_MUX(128, 0)
#define GPIO_PIO41_PIO4_1 IOPCTL_MUX(129, 0)
#define GPIO_PIO42_PIO4_2 IOPCTL_MUX(130, 0)
#define GPIO_PIO43_PIO4_3 IOPCTL_MUX(131, 0)
#define GPIO_PIO44_PIO4_4 IOPCTL_MUX(132, 0)
#define GPIO_PIO45_PIO4_5 IOPCTL_MUX(133, 0)
#define GPIO_PIO46_PIO4_6 IOPCTL_MUX(134, 0)
#define I2S_BRIDGE_CLK_IN_PIO0_0 IOPCTL_MUX(0, 5)
#define I2S_BRIDGE_CLK_IN_PIO0_14 IOPCTL_MUX(14, 5)
#define I2S_BRIDGE_CLK_OUT_PIO0_28 IOPCTL_MUX(28, 5)
#define I2S_BRIDGE_CLK_OUT_PIO0_7 IOPCTL_MUX(7, 5)
#define I2S_BRIDGE_DATA_IN_PIO0_16 IOPCTL_MUX(16, 5)
#define I2S_BRIDGE_DATA_IN_PIO0_2 IOPCTL_MUX(2, 5)
#define I2S_BRIDGE_DATA_OUT_PIO0_30 IOPCTL_MUX(30, 5)
#define I2S_BRIDGE_DATA_OUT_PIO0_9 IOPCTL_MUX(9, 5)
#define I2S_BRIDGE_WS_IN_PIO0_1 IOPCTL_MUX(1, 5)
#define I2S_BRIDGE_WS_IN_PIO0_15 IOPCTL_MUX(15, 5)
#define I2S_BRIDGE_WS_OUT_PIO0_29 IOPCTL_MUX(29, 5)
#define I2S_BRIDGE_WS_OUT_PIO0_8 IOPCTL_MUX(8, 5)
#define I3C0_PUR_PIO2_31 IOPCTL_MUX(95, 1)
#define I3C0_SCL_PIO2_29 IOPCTL_MUX(93, 1)
#define I3C0_SDA_PIO2_30 IOPCTL_MUX(94, 1)
#define IOPCTL_MUX(offset, mux)		 ((((offset) & 0xFFF) << 20) |		 (((mux) & 0xF) << 0))
#define MCLK_PIO1_10 IOPCTL_MUX(42, 1)
#define MCLK_PIO3_19 IOPCTL_MUX(115, 5)
#define PINT_PINT0_PIO0_0 IOPCTL_MUX(0, 0)
#define PINT_PINT0_PIO0_1 IOPCTL_MUX(1, 0)
#define PINT_PINT0_PIO0_10 IOPCTL_MUX(10, 0)
#define PINT_PINT0_PIO0_11 IOPCTL_MUX(11, 0)
#define PINT_PINT0_PIO0_12 IOPCTL_MUX(12, 0)
#define PINT_PINT0_PIO0_13 IOPCTL_MUX(13, 0)
#define PINT_PINT0_PIO0_14 IOPCTL_MUX(14, 0)
#define PINT_PINT0_PIO0_15 IOPCTL_MUX(15, 0)
#define PINT_PINT0_PIO0_16 IOPCTL_MUX(16, 0)
#define PINT_PINT0_PIO0_17 IOPCTL_MUX(17, 0)
#define PINT_PINT0_PIO0_18 IOPCTL_MUX(18, 0)
#define PINT_PINT0_PIO0_19 IOPCTL_MUX(19, 0)
#define PINT_PINT0_PIO0_2 IOPCTL_MUX(2, 0)
#define PINT_PINT0_PIO0_21 IOPCTL_MUX(21, 0)
#define PINT_PINT0_PIO0_22 IOPCTL_MUX(22, 0)
#define PINT_PINT0_PIO0_23 IOPCTL_MUX(23, 0)
#define PINT_PINT0_PIO0_24 IOPCTL_MUX(24, 0)
#define PINT_PINT0_PIO0_25 IOPCTL_MUX(25, 0)
#define PINT_PINT0_PIO0_28 IOPCTL_MUX(28, 0)
#define PINT_PINT0_PIO0_29 IOPCTL_MUX(29, 0)
#define PINT_PINT0_PIO0_3 IOPCTL_MUX(3, 0)
#define PINT_PINT0_PIO0_30 IOPCTL_MUX(30, 0)
#define PINT_PINT0_PIO0_31 IOPCTL_MUX(31, 0)
#define PINT_PINT0_PIO0_4 IOPCTL_MUX(4, 0)
#define PINT_PINT0_PIO0_5 IOPCTL_MUX(5, 0)
#define PINT_PINT0_PIO0_6 IOPCTL_MUX(6, 0)
#define PINT_PINT0_PIO0_7 IOPCTL_MUX(7, 0)
#define PINT_PINT0_PIO0_8 IOPCTL_MUX(8, 0)
#define PINT_PINT0_PIO0_9 IOPCTL_MUX(9, 0)
#define PINT_PINT0_PIO1_0 IOPCTL_MUX(32, 0)
#define PINT_PINT0_PIO1_10 IOPCTL_MUX(42, 0)
#define PINT_PINT0_PIO1_11 IOPCTL_MUX(43, 0)
#define PINT_PINT0_PIO1_12 IOPCTL_MUX(44, 0)
#define PINT_PINT0_PIO1_13 IOPCTL_MUX(45, 0)
#define PINT_PINT0_PIO1_14 IOPCTL_MUX(46, 0)
#define PINT_PINT0_PIO1_15 IOPCTL_MUX(47, 0)
#define PINT_PINT0_PIO1_18 IOPCTL_MUX(50, 0)
#define PINT_PINT0_PIO1_19 IOPCTL_MUX(51, 0)
#define PINT_PINT0_PIO1_20 IOPCTL_MUX(52, 0)
#define PINT_PINT0_PIO1_21 IOPCTL_MUX(53, 0)
#define PINT_PINT0_PIO1_22 IOPCTL_MUX(54, 0)
#define PINT_PINT0_PIO1_23 IOPCTL_MUX(55, 0)
#define PINT_PINT0_PIO1_24 IOPCTL_MUX(56, 0)
#define PINT_PINT0_PIO1_25 IOPCTL_MUX(57, 0)
#define PINT_PINT0_PIO1_26 IOPCTL_MUX(58, 0)
#define PINT_PINT0_PIO1_27 IOPCTL_MUX(59, 0)
#define PINT_PINT0_PIO1_28 IOPCTL_MUX(60, 0)
#define PINT_PINT0_PIO1_29 IOPCTL_MUX(61, 0)
#define PINT_PINT0_PIO1_3 IOPCTL_MUX(35, 0)
#define PINT_PINT0_PIO1_30 IOPCTL_MUX(62, 0)
#define PINT_PINT0_PIO1_31 IOPCTL_MUX(63, 0)
#define PINT_PINT0_PIO1_4 IOPCTL_MUX(36, 0)
#define PINT_PINT0_PIO1_5 IOPCTL_MUX(37, 0)
#define PINT_PINT0_PIO1_6 IOPCTL_MUX(38, 0)
#define PINT_PINT0_PIO1_7 IOPCTL_MUX(39, 0)
#define PINT_PINT1_PIO0_0 IOPCTL_MUX(0, 0)
#define PINT_PINT1_PIO0_1 IOPCTL_MUX(1, 0)
#define PINT_PINT1_PIO0_10 IOPCTL_MUX(10, 0)
#define PINT_PINT1_PIO0_11 IOPCTL_MUX(11, 0)
#define PINT_PINT1_PIO0_12 IOPCTL_MUX(12, 0)
#define PINT_PINT1_PIO0_13 IOPCTL_MUX(13, 0)
#define PINT_PINT1_PIO0_14 IOPCTL_MUX(14, 0)
#define PINT_PINT1_PIO0_15 IOPCTL_MUX(15, 0)
#define PINT_PINT1_PIO0_16 IOPCTL_MUX(16, 0)
#define PINT_PINT1_PIO0_17 IOPCTL_MUX(17, 0)
#define PINT_PINT1_PIO0_18 IOPCTL_MUX(18, 0)
#define PINT_PINT1_PIO0_19 IOPCTL_MUX(19, 0)
#define PINT_PINT1_PIO0_2 IOPCTL_MUX(2, 0)
#define PINT_PINT1_PIO0_21 IOPCTL_MUX(21, 0)
#define PINT_PINT1_PIO0_22 IOPCTL_MUX(22, 0)
#define PINT_PINT1_PIO0_23 IOPCTL_MUX(23, 0)
#define PINT_PINT1_PIO0_24 IOPCTL_MUX(24, 0)
#define PINT_PINT1_PIO0_25 IOPCTL_MUX(25, 0)
#define PINT_PINT1_PIO0_28 IOPCTL_MUX(28, 0)
#define PINT_PINT1_PIO0_29 IOPCTL_MUX(29, 0)
#define PINT_PINT1_PIO0_3 IOPCTL_MUX(3, 0)
#define PINT_PINT1_PIO0_30 IOPCTL_MUX(30, 0)
#define PINT_PINT1_PIO0_31 IOPCTL_MUX(31, 0)
#define PINT_PINT1_PIO0_4 IOPCTL_MUX(4, 0)
#define PINT_PINT1_PIO0_5 IOPCTL_MUX(5, 0)
#define PINT_PINT1_PIO0_6 IOPCTL_MUX(6, 0)
#define PINT_PINT1_PIO0_7 IOPCTL_MUX(7, 0)
#define PINT_PINT1_PIO0_8 IOPCTL_MUX(8, 0)
#define PINT_PINT1_PIO0_9 IOPCTL_MUX(9, 0)
#define PINT_PINT1_PIO1_0 IOPCTL_MUX(32, 0)
#define PINT_PINT1_PIO1_10 IOPCTL_MUX(42, 0)
#define PINT_PINT1_PIO1_11 IOPCTL_MUX(43, 0)
#define PINT_PINT1_PIO1_12 IOPCTL_MUX(44, 0)
#define PINT_PINT1_PIO1_13 IOPCTL_MUX(45, 0)
#define PINT_PINT1_PIO1_14 IOPCTL_MUX(46, 0)
#define PINT_PINT1_PIO1_15 IOPCTL_MUX(47, 0)
#define PINT_PINT1_PIO1_18 IOPCTL_MUX(50, 0)
#define PINT_PINT1_PIO1_19 IOPCTL_MUX(51, 0)
#define PINT_PINT1_PIO1_20 IOPCTL_MUX(52, 0)
#define PINT_PINT1_PIO1_21 IOPCTL_MUX(53, 0)
#define PINT_PINT1_PIO1_22 IOPCTL_MUX(54, 0)
#define PINT_PINT1_PIO1_23 IOPCTL_MUX(55, 0)
#define PINT_PINT1_PIO1_24 IOPCTL_MUX(56, 0)
#define PINT_PINT1_PIO1_25 IOPCTL_MUX(57, 0)
#define PINT_PINT1_PIO1_26 IOPCTL_MUX(58, 0)
#define PINT_PINT1_PIO1_27 IOPCTL_MUX(59, 0)
#define PINT_PINT1_PIO1_28 IOPCTL_MUX(60, 0)
#define PINT_PINT1_PIO1_29 IOPCTL_MUX(61, 0)
#define PINT_PINT1_PIO1_3 IOPCTL_MUX(35, 0)
#define PINT_PINT1_PIO1_30 IOPCTL_MUX(62, 0)
#define PINT_PINT1_PIO1_31 IOPCTL_MUX(63, 0)
#define PINT_PINT1_PIO1_4 IOPCTL_MUX(36, 0)
#define PINT_PINT1_PIO1_5 IOPCTL_MUX(37, 0)
#define PINT_PINT1_PIO1_6 IOPCTL_MUX(38, 0)
#define PINT_PINT1_PIO1_7 IOPCTL_MUX(39, 0)
#define PINT_PINT2_PIO0_0 IOPCTL_MUX(0, 0)
#define PINT_PINT2_PIO0_1 IOPCTL_MUX(1, 0)
#define PINT_PINT2_PIO0_10 IOPCTL_MUX(10, 0)
#define PINT_PINT2_PIO0_11 IOPCTL_MUX(11, 0)
#define PINT_PINT2_PIO0_12 IOPCTL_MUX(12, 0)
#define PINT_PINT2_PIO0_13 IOPCTL_MUX(13, 0)
#define PINT_PINT2_PIO0_14 IOPCTL_MUX(14, 0)
#define PINT_PINT2_PIO0_15 IOPCTL_MUX(15, 0)
#define PINT_PINT2_PIO0_16 IOPCTL_MUX(16, 0)
#define PINT_PINT2_PIO0_17 IOPCTL_MUX(17, 0)
#define PINT_PINT2_PIO0_18 IOPCTL_MUX(18, 0)
#define PINT_PINT2_PIO0_19 IOPCTL_MUX(19, 0)
#define PINT_PINT2_PIO0_2 IOPCTL_MUX(2, 0)
#define PINT_PINT2_PIO0_21 IOPCTL_MUX(21, 0)
#define PINT_PINT2_PIO0_22 IOPCTL_MUX(22, 0)
#define PINT_PINT2_PIO0_23 IOPCTL_MUX(23, 0)
#define PINT_PINT2_PIO0_24 IOPCTL_MUX(24, 0)
#define PINT_PINT2_PIO0_25 IOPCTL_MUX(25, 0)
#define PINT_PINT2_PIO0_28 IOPCTL_MUX(28, 0)
#define PINT_PINT2_PIO0_29 IOPCTL_MUX(29, 0)
#define PINT_PINT2_PIO0_3 IOPCTL_MUX(3, 0)
#define PINT_PINT2_PIO0_30 IOPCTL_MUX(30, 0)
#define PINT_PINT2_PIO0_31 IOPCTL_MUX(31, 0)
#define PINT_PINT2_PIO0_4 IOPCTL_MUX(4, 0)
#define PINT_PINT2_PIO0_5 IOPCTL_MUX(5, 0)
#define PINT_PINT2_PIO0_6 IOPCTL_MUX(6, 0)
#define PINT_PINT2_PIO0_7 IOPCTL_MUX(7, 0)
#define PINT_PINT2_PIO0_8 IOPCTL_MUX(8, 0)
#define PINT_PINT2_PIO0_9 IOPCTL_MUX(9, 0)
#define PINT_PINT2_PIO1_0 IOPCTL_MUX(32, 0)
#define PINT_PINT2_PIO1_10 IOPCTL_MUX(42, 0)
#define PINT_PINT2_PIO1_11 IOPCTL_MUX(43, 0)
#define PINT_PINT2_PIO1_12 IOPCTL_MUX(44, 0)
#define PINT_PINT2_PIO1_13 IOPCTL_MUX(45, 0)
#define PINT_PINT2_PIO1_14 IOPCTL_MUX(46, 0)
#define PINT_PINT2_PIO1_15 IOPCTL_MUX(47, 0)
#define PINT_PINT2_PIO1_18 IOPCTL_MUX(50, 0)
#define PINT_PINT2_PIO1_19 IOPCTL_MUX(51, 0)
#define PINT_PINT2_PIO1_20 IOPCTL_MUX(52, 0)
#define PINT_PINT2_PIO1_21 IOPCTL_MUX(53, 0)
#define PINT_PINT2_PIO1_22 IOPCTL_MUX(54, 0)
#define PINT_PINT2_PIO1_23 IOPCTL_MUX(55, 0)
#define PINT_PINT2_PIO1_24 IOPCTL_MUX(56, 0)
#define PINT_PINT2_PIO1_25 IOPCTL_MUX(57, 0)
#define PINT_PINT2_PIO1_26 IOPCTL_MUX(58, 0)
#define PINT_PINT2_PIO1_27 IOPCTL_MUX(59, 0)
#define PINT_PINT2_PIO1_28 IOPCTL_MUX(60, 0)
#define PINT_PINT2_PIO1_29 IOPCTL_MUX(61, 0)
#define PINT_PINT2_PIO1_3 IOPCTL_MUX(35, 0)
#define PINT_PINT2_PIO1_30 IOPCTL_MUX(62, 0)
#define PINT_PINT2_PIO1_31 IOPCTL_MUX(63, 0)
#define PINT_PINT2_PIO1_4 IOPCTL_MUX(36, 0)
#define PINT_PINT2_PIO1_5 IOPCTL_MUX(37, 0)
#define PINT_PINT2_PIO1_6 IOPCTL_MUX(38, 0)
#define PINT_PINT2_PIO1_7 IOPCTL_MUX(39, 0)
#define PINT_PINT3_PIO0_0 IOPCTL_MUX(0, 0)
#define PINT_PINT3_PIO0_1 IOPCTL_MUX(1, 0)
#define PINT_PINT3_PIO0_10 IOPCTL_MUX(10, 0)
#define PINT_PINT3_PIO0_11 IOPCTL_MUX(11, 0)
#define PINT_PINT3_PIO0_12 IOPCTL_MUX(12, 0)
#define PINT_PINT3_PIO0_13 IOPCTL_MUX(13, 0)
#define PINT_PINT3_PIO0_14 IOPCTL_MUX(14, 0)
#define PINT_PINT3_PIO0_15 IOPCTL_MUX(15, 0)
#define PINT_PINT3_PIO0_16 IOPCTL_MUX(16, 0)
#define PINT_PINT3_PIO0_17 IOPCTL_MUX(17, 0)
#define PINT_PINT3_PIO0_18 IOPCTL_MUX(18, 0)
#define PINT_PINT3_PIO0_19 IOPCTL_MUX(19, 0)
#define PINT_PINT3_PIO0_2 IOPCTL_MUX(2, 0)
#define PINT_PINT3_PIO0_21 IOPCTL_MUX(21, 0)
#define PINT_PINT3_PIO0_22 IOPCTL_MUX(22, 0)
#define PINT_PINT3_PIO0_23 IOPCTL_MUX(23, 0)
#define PINT_PINT3_PIO0_24 IOPCTL_MUX(24, 0)
#define PINT_PINT3_PIO0_25 IOPCTL_MUX(25, 0)
#define PINT_PINT3_PIO0_28 IOPCTL_MUX(28, 0)
#define PINT_PINT3_PIO0_29 IOPCTL_MUX(29, 0)
#define PINT_PINT3_PIO0_3 IOPCTL_MUX(3, 0)
#define PINT_PINT3_PIO0_30 IOPCTL_MUX(30, 0)
#define PINT_PINT3_PIO0_31 IOPCTL_MUX(31, 0)
#define PINT_PINT3_PIO0_4 IOPCTL_MUX(4, 0)
#define PINT_PINT3_PIO0_5 IOPCTL_MUX(5, 0)
#define PINT_PINT3_PIO0_6 IOPCTL_MUX(6, 0)
#define PINT_PINT3_PIO0_7 IOPCTL_MUX(7, 0)
#define PINT_PINT3_PIO0_8 IOPCTL_MUX(8, 0)
#define PINT_PINT3_PIO0_9 IOPCTL_MUX(9, 0)
#define PINT_PINT3_PIO1_0 IOPCTL_MUX(32, 0)
#define PINT_PINT3_PIO1_10 IOPCTL_MUX(42, 0)
#define PINT_PINT3_PIO1_11 IOPCTL_MUX(43, 0)
#define PINT_PINT3_PIO1_12 IOPCTL_MUX(44, 0)
#define PINT_PINT3_PIO1_13 IOPCTL_MUX(45, 0)
#define PINT_PINT3_PIO1_14 IOPCTL_MUX(46, 0)
#define PINT_PINT3_PIO1_15 IOPCTL_MUX(47, 0)
#define PINT_PINT3_PIO1_18 IOPCTL_MUX(50, 0)
#define PINT_PINT3_PIO1_19 IOPCTL_MUX(51, 0)
#define PINT_PINT3_PIO1_20 IOPCTL_MUX(52, 0)
#define PINT_PINT3_PIO1_21 IOPCTL_MUX(53, 0)
#define PINT_PINT3_PIO1_22 IOPCTL_MUX(54, 0)
#define PINT_PINT3_PIO1_23 IOPCTL_MUX(55, 0)
#define PINT_PINT3_PIO1_24 IOPCTL_MUX(56, 0)
#define PINT_PINT3_PIO1_25 IOPCTL_MUX(57, 0)
#define PINT_PINT3_PIO1_26 IOPCTL_MUX(58, 0)
#define PINT_PINT3_PIO1_27 IOPCTL_MUX(59, 0)
#define PINT_PINT3_PIO1_28 IOPCTL_MUX(60, 0)
#define PINT_PINT3_PIO1_29 IOPCTL_MUX(61, 0)
#define PINT_PINT3_PIO1_3 IOPCTL_MUX(35, 0)
#define PINT_PINT3_PIO1_30 IOPCTL_MUX(62, 0)
#define PINT_PINT3_PIO1_31 IOPCTL_MUX(63, 0)
#define PINT_PINT3_PIO1_4 IOPCTL_MUX(36, 0)
#define PINT_PINT3_PIO1_5 IOPCTL_MUX(37, 0)
#define PINT_PINT3_PIO1_6 IOPCTL_MUX(38, 0)
#define PINT_PINT3_PIO1_7 IOPCTL_MUX(39, 0)
#define PINT_PINT4_PIO0_0 IOPCTL_MUX(0, 0)
#define PINT_PINT4_PIO0_1 IOPCTL_MUX(1, 0)
#define PINT_PINT4_PIO0_10 IOPCTL_MUX(10, 0)
#define PINT_PINT4_PIO0_11 IOPCTL_MUX(11, 0)
#define PINT_PINT4_PIO0_12 IOPCTL_MUX(12, 0)
#define PINT_PINT4_PIO0_13 IOPCTL_MUX(13, 0)
#define PINT_PINT4_PIO0_14 IOPCTL_MUX(14, 0)
#define PINT_PINT4_PIO0_15 IOPCTL_MUX(15, 0)
#define PINT_PINT4_PIO0_16 IOPCTL_MUX(16, 0)
#define PINT_PINT4_PIO0_17 IOPCTL_MUX(17, 0)
#define PINT_PINT4_PIO0_18 IOPCTL_MUX(18, 0)
#define PINT_PINT4_PIO0_19 IOPCTL_MUX(19, 0)
#define PINT_PINT4_PIO0_2 IOPCTL_MUX(2, 0)
#define PINT_PINT4_PIO0_21 IOPCTL_MUX(21, 0)
#define PINT_PINT4_PIO0_22 IOPCTL_MUX(22, 0)
#define PINT_PINT4_PIO0_23 IOPCTL_MUX(23, 0)
#define PINT_PINT4_PIO0_24 IOPCTL_MUX(24, 0)
#define PINT_PINT4_PIO0_25 IOPCTL_MUX(25, 0)
#define PINT_PINT4_PIO0_28 IOPCTL_MUX(28, 0)
#define PINT_PINT4_PIO0_29 IOPCTL_MUX(29, 0)
#define PINT_PINT4_PIO0_3 IOPCTL_MUX(3, 0)
#define PINT_PINT4_PIO0_30 IOPCTL_MUX(30, 0)
#define PINT_PINT4_PIO0_31 IOPCTL_MUX(31, 0)
#define PINT_PINT4_PIO0_4 IOPCTL_MUX(4, 0)
#define PINT_PINT4_PIO0_5 IOPCTL_MUX(5, 0)
#define PINT_PINT4_PIO0_6 IOPCTL_MUX(6, 0)
#define PINT_PINT4_PIO0_7 IOPCTL_MUX(7, 0)
#define PINT_PINT4_PIO0_8 IOPCTL_MUX(8, 0)
#define PINT_PINT4_PIO0_9 IOPCTL_MUX(9, 0)
#define PINT_PINT4_PIO1_0 IOPCTL_MUX(32, 0)
#define PINT_PINT4_PIO1_10 IOPCTL_MUX(42, 0)
#define PINT_PINT4_PIO1_11 IOPCTL_MUX(43, 0)
#define PINT_PINT4_PIO1_12 IOPCTL_MUX(44, 0)
#define PINT_PINT4_PIO1_13 IOPCTL_MUX(45, 0)
#define PINT_PINT4_PIO1_14 IOPCTL_MUX(46, 0)
#define PINT_PINT4_PIO1_15 IOPCTL_MUX(47, 0)
#define PINT_PINT4_PIO1_18 IOPCTL_MUX(50, 0)
#define PINT_PINT4_PIO1_19 IOPCTL_MUX(51, 0)
#define PINT_PINT4_PIO1_20 IOPCTL_MUX(52, 0)
#define PINT_PINT4_PIO1_21 IOPCTL_MUX(53, 0)
#define PINT_PINT4_PIO1_22 IOPCTL_MUX(54, 0)
#define PINT_PINT4_PIO1_23 IOPCTL_MUX(55, 0)
#define PINT_PINT4_PIO1_24 IOPCTL_MUX(56, 0)
#define PINT_PINT4_PIO1_25 IOPCTL_MUX(57, 0)
#define PINT_PINT4_PIO1_26 IOPCTL_MUX(58, 0)
#define PINT_PINT4_PIO1_27 IOPCTL_MUX(59, 0)
#define PINT_PINT4_PIO1_28 IOPCTL_MUX(60, 0)
#define PINT_PINT4_PIO1_29 IOPCTL_MUX(61, 0)
#define PINT_PINT4_PIO1_3 IOPCTL_MUX(35, 0)
#define PINT_PINT4_PIO1_30 IOPCTL_MUX(62, 0)
#define PINT_PINT4_PIO1_31 IOPCTL_MUX(63, 0)
#define PINT_PINT4_PIO1_4 IOPCTL_MUX(36, 0)
#define PINT_PINT4_PIO1_5 IOPCTL_MUX(37, 0)
#define PINT_PINT4_PIO1_6 IOPCTL_MUX(38, 0)
#define PINT_PINT4_PIO1_7 IOPCTL_MUX(39, 0)
#define PINT_PINT5_PIO0_0 IOPCTL_MUX(0, 0)
#define PINT_PINT5_PIO0_1 IOPCTL_MUX(1, 0)
#define PINT_PINT5_PIO0_10 IOPCTL_MUX(10, 0)
#define PINT_PINT5_PIO0_11 IOPCTL_MUX(11, 0)
#define PINT_PINT5_PIO0_12 IOPCTL_MUX(12, 0)
#define PINT_PINT5_PIO0_13 IOPCTL_MUX(13, 0)
#define PINT_PINT5_PIO0_14 IOPCTL_MUX(14, 0)
#define PINT_PINT5_PIO0_15 IOPCTL_MUX(15, 0)
#define PINT_PINT5_PIO0_16 IOPCTL_MUX(16, 0)
#define PINT_PINT5_PIO0_17 IOPCTL_MUX(17, 0)
#define PINT_PINT5_PIO0_18 IOPCTL_MUX(18, 0)
#define PINT_PINT5_PIO0_19 IOPCTL_MUX(19, 0)
#define PINT_PINT5_PIO0_2 IOPCTL_MUX(2, 0)
#define PINT_PINT5_PIO0_21 IOPCTL_MUX(21, 0)
#define PINT_PINT5_PIO0_22 IOPCTL_MUX(22, 0)
#define PINT_PINT5_PIO0_23 IOPCTL_MUX(23, 0)
#define PINT_PINT5_PIO0_24 IOPCTL_MUX(24, 0)
#define PINT_PINT5_PIO0_25 IOPCTL_MUX(25, 0)
#define PINT_PINT5_PIO0_28 IOPCTL_MUX(28, 0)
#define PINT_PINT5_PIO0_29 IOPCTL_MUX(29, 0)
#define PINT_PINT5_PIO0_3 IOPCTL_MUX(3, 0)
#define PINT_PINT5_PIO0_30 IOPCTL_MUX(30, 0)
#define PINT_PINT5_PIO0_31 IOPCTL_MUX(31, 0)
#define PINT_PINT5_PIO0_4 IOPCTL_MUX(4, 0)
#define PINT_PINT5_PIO0_5 IOPCTL_MUX(5, 0)
#define PINT_PINT5_PIO0_6 IOPCTL_MUX(6, 0)
#define PINT_PINT5_PIO0_7 IOPCTL_MUX(7, 0)
#define PINT_PINT5_PIO0_8 IOPCTL_MUX(8, 0)
#define PINT_PINT5_PIO0_9 IOPCTL_MUX(9, 0)
#define PINT_PINT5_PIO1_0 IOPCTL_MUX(32, 0)
#define PINT_PINT5_PIO1_10 IOPCTL_MUX(42, 0)
#define PINT_PINT5_PIO1_11 IOPCTL_MUX(43, 0)
#define PINT_PINT5_PIO1_12 IOPCTL_MUX(44, 0)
#define PINT_PINT5_PIO1_13 IOPCTL_MUX(45, 0)
#define PINT_PINT5_PIO1_14 IOPCTL_MUX(46, 0)
#define PINT_PINT5_PIO1_15 IOPCTL_MUX(47, 0)
#define PINT_PINT5_PIO1_18 IOPCTL_MUX(50, 0)
#define PINT_PINT5_PIO1_19 IOPCTL_MUX(51, 0)
#define PINT_PINT5_PIO1_20 IOPCTL_MUX(52, 0)
#define PINT_PINT5_PIO1_21 IOPCTL_MUX(53, 0)
#define PINT_PINT5_PIO1_22 IOPCTL_MUX(54, 0)
#define PINT_PINT5_PIO1_23 IOPCTL_MUX(55, 0)
#define PINT_PINT5_PIO1_24 IOPCTL_MUX(56, 0)
#define PINT_PINT5_PIO1_25 IOPCTL_MUX(57, 0)
#define PINT_PINT5_PIO1_26 IOPCTL_MUX(58, 0)
#define PINT_PINT5_PIO1_27 IOPCTL_MUX(59, 0)
#define PINT_PINT5_PIO1_28 IOPCTL_MUX(60, 0)
#define PINT_PINT5_PIO1_29 IOPCTL_MUX(61, 0)
#define PINT_PINT5_PIO1_3 IOPCTL_MUX(35, 0)
#define PINT_PINT5_PIO1_30 IOPCTL_MUX(62, 0)
#define PINT_PINT5_PIO1_31 IOPCTL_MUX(63, 0)
#define PINT_PINT5_PIO1_4 IOPCTL_MUX(36, 0)
#define PINT_PINT5_PIO1_5 IOPCTL_MUX(37, 0)
#define PINT_PINT5_PIO1_6 IOPCTL_MUX(38, 0)
#define PINT_PINT5_PIO1_7 IOPCTL_MUX(39, 0)
#define PINT_PINT6_PIO0_0 IOPCTL_MUX(0, 0)
#define PINT_PINT6_PIO0_1 IOPCTL_MUX(1, 0)
#define PINT_PINT6_PIO0_10 IOPCTL_MUX(10, 0)
#define PINT_PINT6_PIO0_11 IOPCTL_MUX(11, 0)
#define PINT_PINT6_PIO0_12 IOPCTL_MUX(12, 0)
#define PINT_PINT6_PIO0_13 IOPCTL_MUX(13, 0)
#define PINT_PINT6_PIO0_14 IOPCTL_MUX(14, 0)
#define PINT_PINT6_PIO0_15 IOPCTL_MUX(15, 0)
#define PINT_PINT6_PIO0_16 IOPCTL_MUX(16, 0)
#define PINT_PINT6_PIO0_17 IOPCTL_MUX(17, 0)
#define PINT_PINT6_PIO0_18 IOPCTL_MUX(18, 0)
#define PINT_PINT6_PIO0_19 IOPCTL_MUX(19, 0)
#define PINT_PINT6_PIO0_2 IOPCTL_MUX(2, 0)
#define PINT_PINT6_PIO0_21 IOPCTL_MUX(21, 0)
#define PINT_PINT6_PIO0_22 IOPCTL_MUX(22, 0)
#define PINT_PINT6_PIO0_23 IOPCTL_MUX(23, 0)
#define PINT_PINT6_PIO0_24 IOPCTL_MUX(24, 0)
#define PINT_PINT6_PIO0_25 IOPCTL_MUX(25, 0)
#define PINT_PINT6_PIO0_28 IOPCTL_MUX(28, 0)
#define PINT_PINT6_PIO0_29 IOPCTL_MUX(29, 0)
#define PINT_PINT6_PIO0_3 IOPCTL_MUX(3, 0)
#define PINT_PINT6_PIO0_30 IOPCTL_MUX(30, 0)
#define PINT_PINT6_PIO0_31 IOPCTL_MUX(31, 0)
#define PINT_PINT6_PIO0_4 IOPCTL_MUX(4, 0)
#define PINT_PINT6_PIO0_5 IOPCTL_MUX(5, 0)
#define PINT_PINT6_PIO0_6 IOPCTL_MUX(6, 0)
#define PINT_PINT6_PIO0_7 IOPCTL_MUX(7, 0)
#define PINT_PINT6_PIO0_8 IOPCTL_MUX(8, 0)
#define PINT_PINT6_PIO0_9 IOPCTL_MUX(9, 0)
#define PINT_PINT6_PIO1_0 IOPCTL_MUX(32, 0)
#define PINT_PINT6_PIO1_10 IOPCTL_MUX(42, 0)
#define PINT_PINT6_PIO1_11 IOPCTL_MUX(43, 0)
#define PINT_PINT6_PIO1_12 IOPCTL_MUX(44, 0)
#define PINT_PINT6_PIO1_13 IOPCTL_MUX(45, 0)
#define PINT_PINT6_PIO1_14 IOPCTL_MUX(46, 0)
#define PINT_PINT6_PIO1_15 IOPCTL_MUX(47, 0)
#define PINT_PINT6_PIO1_18 IOPCTL_MUX(50, 0)
#define PINT_PINT6_PIO1_19 IOPCTL_MUX(51, 0)
#define PINT_PINT6_PIO1_20 IOPCTL_MUX(52, 0)
#define PINT_PINT6_PIO1_21 IOPCTL_MUX(53, 0)
#define PINT_PINT6_PIO1_22 IOPCTL_MUX(54, 0)
#define PINT_PINT6_PIO1_23 IOPCTL_MUX(55, 0)
#define PINT_PINT6_PIO1_24 IOPCTL_MUX(56, 0)
#define PINT_PINT6_PIO1_25 IOPCTL_MUX(57, 0)
#define PINT_PINT6_PIO1_26 IOPCTL_MUX(58, 0)
#define PINT_PINT6_PIO1_27 IOPCTL_MUX(59, 0)
#define PINT_PINT6_PIO1_28 IOPCTL_MUX(60, 0)
#define PINT_PINT6_PIO1_29 IOPCTL_MUX(61, 0)
#define PINT_PINT6_PIO1_3 IOPCTL_MUX(35, 0)
#define PINT_PINT6_PIO1_30 IOPCTL_MUX(62, 0)
#define PINT_PINT6_PIO1_31 IOPCTL_MUX(63, 0)
#define PINT_PINT6_PIO1_4 IOPCTL_MUX(36, 0)
#define PINT_PINT6_PIO1_5 IOPCTL_MUX(37, 0)
#define PINT_PINT6_PIO1_6 IOPCTL_MUX(38, 0)
#define PINT_PINT6_PIO1_7 IOPCTL_MUX(39, 0)
#define PINT_PINT7_PIO0_0 IOPCTL_MUX(0, 0)
#define PINT_PINT7_PIO0_1 IOPCTL_MUX(1, 0)
#define PINT_PINT7_PIO0_10 IOPCTL_MUX(10, 0)
#define PINT_PINT7_PIO0_11 IOPCTL_MUX(11, 0)
#define PINT_PINT7_PIO0_12 IOPCTL_MUX(12, 0)
#define PINT_PINT7_PIO0_13 IOPCTL_MUX(13, 0)
#define PINT_PINT7_PIO0_14 IOPCTL_MUX(14, 0)
#define PINT_PINT7_PIO0_15 IOPCTL_MUX(15, 0)
#define PINT_PINT7_PIO0_16 IOPCTL_MUX(16, 0)
#define PINT_PINT7_PIO0_17 IOPCTL_MUX(17, 0)
#define PINT_PINT7_PIO0_18 IOPCTL_MUX(18, 0)
#define PINT_PINT7_PIO0_19 IOPCTL_MUX(19, 0)
#define PINT_PINT7_PIO0_2 IOPCTL_MUX(2, 0)
#define PINT_PINT7_PIO0_21 IOPCTL_MUX(21, 0)
#define PINT_PINT7_PIO0_22 IOPCTL_MUX(22, 0)
#define PINT_PINT7_PIO0_23 IOPCTL_MUX(23, 0)
#define PINT_PINT7_PIO0_24 IOPCTL_MUX(24, 0)
#define PINT_PINT7_PIO0_25 IOPCTL_MUX(25, 0)
#define PINT_PINT7_PIO0_28 IOPCTL_MUX(28, 0)
#define PINT_PINT7_PIO0_29 IOPCTL_MUX(29, 0)
#define PINT_PINT7_PIO0_3 IOPCTL_MUX(3, 0)
#define PINT_PINT7_PIO0_30 IOPCTL_MUX(30, 0)
#define PINT_PINT7_PIO0_31 IOPCTL_MUX(31, 0)
#define PINT_PINT7_PIO0_4 IOPCTL_MUX(4, 0)
#define PINT_PINT7_PIO0_5 IOPCTL_MUX(5, 0)
#define PINT_PINT7_PIO0_6 IOPCTL_MUX(6, 0)
#define PINT_PINT7_PIO0_7 IOPCTL_MUX(7, 0)
#define PINT_PINT7_PIO0_8 IOPCTL_MUX(8, 0)
#define PINT_PINT7_PIO0_9 IOPCTL_MUX(9, 0)
#define PINT_PINT7_PIO1_0 IOPCTL_MUX(32, 0)
#define PINT_PINT7_PIO1_10 IOPCTL_MUX(42, 0)
#define PINT_PINT7_PIO1_11 IOPCTL_MUX(43, 0)
#define PINT_PINT7_PIO1_12 IOPCTL_MUX(44, 0)
#define PINT_PINT7_PIO1_13 IOPCTL_MUX(45, 0)
#define PINT_PINT7_PIO1_14 IOPCTL_MUX(46, 0)
#define PINT_PINT7_PIO1_15 IOPCTL_MUX(47, 0)
#define PINT_PINT7_PIO1_18 IOPCTL_MUX(50, 0)
#define PINT_PINT7_PIO1_19 IOPCTL_MUX(51, 0)
#define PINT_PINT7_PIO1_20 IOPCTL_MUX(52, 0)
#define PINT_PINT7_PIO1_21 IOPCTL_MUX(53, 0)
#define PINT_PINT7_PIO1_22 IOPCTL_MUX(54, 0)
#define PINT_PINT7_PIO1_23 IOPCTL_MUX(55, 0)
#define PINT_PINT7_PIO1_24 IOPCTL_MUX(56, 0)
#define PINT_PINT7_PIO1_25 IOPCTL_MUX(57, 0)
#define PINT_PINT7_PIO1_26 IOPCTL_MUX(58, 0)
#define PINT_PINT7_PIO1_27 IOPCTL_MUX(59, 0)
#define PINT_PINT7_PIO1_28 IOPCTL_MUX(60, 0)
#define PINT_PINT7_PIO1_29 IOPCTL_MUX(61, 0)
#define PINT_PINT7_PIO1_3 IOPCTL_MUX(35, 0)
#define PINT_PINT7_PIO1_30 IOPCTL_MUX(62, 0)
#define PINT_PINT7_PIO1_31 IOPCTL_MUX(63, 0)
#define PINT_PINT7_PIO1_4 IOPCTL_MUX(36, 0)
#define PINT_PINT7_PIO1_5 IOPCTL_MUX(37, 0)
#define PINT_PINT7_PIO1_6 IOPCTL_MUX(38, 0)
#define PINT_PINT7_PIO1_7 IOPCTL_MUX(39, 0)
#define PMIC_I2C_SCL IOPCTL_MUX(256, 0)
#define PMIC_I2C_SDA IOPCTL_MUX(257, 0)
#define SCT0_IN0_PIO0_10 IOPCTL_MUX(10, 2)
#define SCT0_IN0_PIO0_11 IOPCTL_MUX(11, 2)
#define SCT0_IN0_PIO0_12 IOPCTL_MUX(12, 2)
#define SCT0_IN0_PIO0_13 IOPCTL_MUX(13, 2)
#define SCT0_IN0_PIO0_14 IOPCTL_MUX(14, 2)
#define SCT0_IN0_PIO0_15 IOPCTL_MUX(15, 2)
#define SCT0_IN0_PIO0_16 IOPCTL_MUX(16, 2)
#define SCT0_IN0_PIO0_17 IOPCTL_MUX(17, 2)
#define SCT0_IN0_PIO0_18 IOPCTL_MUX(18, 2)
#define SCT0_IN0_PIO0_19 IOPCTL_MUX(19, 2)
#define SCT0_IN0_PIO0_31 IOPCTL_MUX(31, 2)
#define SCT0_IN0_PIO0_5 IOPCTL_MUX(5, 2)
#define SCT0_IN0_PIO0_6 IOPCTL_MUX(6, 2)
#define SCT0_IN0_PIO0_7 IOPCTL_MUX(7, 2)
#define SCT0_IN0_PIO0_8 IOPCTL_MUX(8, 2)
#define SCT0_IN0_PIO0_9 IOPCTL_MUX(9, 2)
#define SCT0_IN0_PIO1_0 IOPCTL_MUX(32, 2)
#define SCT0_IN0_PIO1_10 IOPCTL_MUX(42, 1)
#define SCT0_IN0_PIO1_18 IOPCTL_MUX(50, 2)
#define SCT0_IN0_PIO1_20 IOPCTL_MUX(52, 2)
#define SCT0_IN0_PIO1_22 IOPCTL_MUX(54, 2)
#define SCT0_IN0_PIO1_24 IOPCTL_MUX(56, 2)
#define SCT0_IN0_PIO1_26 IOPCTL_MUX(58, 2)
#define SCT0_IN0_PIO1_28 IOPCTL_MUX(60, 2)
#define SCT0_IN0_PIO1_30 IOPCTL_MUX(62, 2)
#define SCT0_IN0_PIO1_31 IOPCTL_MUX(63, 2)
#define SCT0_IN0_PIO1_6 IOPCTL_MUX(38, 2)
#define SCT0_IN0_PIO1_7 IOPCTL_MUX(39, 2)
#define SCT0_IN0_PIO2_0 IOPCTL_MUX(64, 2)
#define SCT0_IN0_PIO2_1 IOPCTL_MUX(65, 2)
#define SCT0_IN0_PIO2_10 IOPCTL_MUX(74, 2)
#define SCT0_IN0_PIO2_11 IOPCTL_MUX(75, 2)
#define SCT0_IN0_PIO2_6 IOPCTL_MUX(70, 2)
#define SCT0_IN0_PIO2_7 IOPCTL_MUX(71, 2)
#define SCT0_IN0_PIO3_19 IOPCTL_MUX(115, 5)
#define SCT0_IN1_PIO0_10 IOPCTL_MUX(10, 2)
#define SCT0_IN1_PIO0_11 IOPCTL_MUX(11, 2)
#define SCT0_IN1_PIO0_12 IOPCTL_MUX(12, 2)
#define SCT0_IN1_PIO0_13 IOPCTL_MUX(13, 2)
#define SCT0_IN1_PIO0_14 IOPCTL_MUX(14, 2)
#define SCT0_IN1_PIO0_15 IOPCTL_MUX(15, 2)
#define SCT0_IN1_PIO0_16 IOPCTL_MUX(16, 2)
#define SCT0_IN1_PIO0_17 IOPCTL_MUX(17, 2)
#define SCT0_IN1_PIO0_18 IOPCTL_MUX(18, 2)
#define SCT0_IN1_PIO0_19 IOPCTL_MUX(19, 2)
#define SCT0_IN1_PIO0_31 IOPCTL_MUX(31, 2)
#define SCT0_IN1_PIO0_5 IOPCTL_MUX(5, 2)
#define SCT0_IN1_PIO0_6 IOPCTL_MUX(6, 2)
#define SCT0_IN1_PIO0_7 IOPCTL_MUX(7, 2)
#define SCT0_IN1_PIO0_8 IOPCTL_MUX(8, 2)
#define SCT0_IN1_PIO0_9 IOPCTL_MUX(9, 2)
#define SCT0_IN1_PIO1_0 IOPCTL_MUX(32, 2)
#define SCT0_IN1_PIO1_10 IOPCTL_MUX(42, 1)
#define SCT0_IN1_PIO1_18 IOPCTL_MUX(50, 2)
#define SCT0_IN1_PIO1_20 IOPCTL_MUX(52, 2)
#define SCT0_IN1_PIO1_22 IOPCTL_MUX(54, 2)
#define SCT0_IN1_PIO1_24 IOPCTL_MUX(56, 2)
#define SCT0_IN1_PIO1_26 IOPCTL_MUX(58, 2)
#define SCT0_IN1_PIO1_28 IOPCTL_MUX(60, 2)
#define SCT0_IN1_PIO1_30 IOPCTL_MUX(62, 2)
#define SCT0_IN1_PIO1_31 IOPCTL_MUX(63, 2)
#define SCT0_IN1_PIO1_6 IOPCTL_MUX(38, 2)
#define SCT0_IN1_PIO1_7 IOPCTL_MUX(39, 2)
#define SCT0_IN1_PIO2_0 IOPCTL_MUX(64, 2)
#define SCT0_IN1_PIO2_1 IOPCTL_MUX(65, 2)
#define SCT0_IN1_PIO2_10 IOPCTL_MUX(74, 2)
#define SCT0_IN1_PIO2_11 IOPCTL_MUX(75, 2)
#define SCT0_IN1_PIO2_6 IOPCTL_MUX(70, 2)
#define SCT0_IN1_PIO2_7 IOPCTL_MUX(71, 2)
#define SCT0_IN1_PIO3_19 IOPCTL_MUX(115, 5)
#define SCT0_IN2_PIO0_10 IOPCTL_MUX(10, 2)
