zephyrproject-rtos/hal_nxp/dts/nxp/imxrt/imxrt5xx/pinctrl/MIMXRT595SFFOC-pinctrl.h
#define SCT0_IN2_PIO0_11 IOPCTL_MUX(11, 2)
#define SCT0_IN2_PIO0_12 IOPCTL_MUX(12, 2)
#define SCT0_IN2_PIO0_13 IOPCTL_MUX(13, 2)
#define SCT0_IN2_PIO0_14 IOPCTL_MUX(14, 2)
#define SCT0_IN2_PIO0_15 IOPCTL_MUX(15, 2)
#define SCT0_IN2_PIO0_16 IOPCTL_MUX(16, 2)
#define SCT0_IN2_PIO0_17 IOPCTL_MUX(17, 2)
#define SCT0_IN2_PIO0_18 IOPCTL_MUX(18, 2)
#define SCT0_IN2_PIO0_19 IOPCTL_MUX(19, 2)
#define SCT0_IN2_PIO0_31 IOPCTL_MUX(31, 2)
#define SCT0_IN2_PIO0_5 IOPCTL_MUX(5, 2)
#define SCT0_IN2_PIO0_6 IOPCTL_MUX(6, 2)
#define SCT0_IN2_PIO0_7 IOPCTL_MUX(7, 2)
#define SCT0_IN2_PIO0_8 IOPCTL_MUX(8, 2)
#define SCT0_IN2_PIO0_9 IOPCTL_MUX(9, 2)
#define SCT0_IN2_PIO1_0 IOPCTL_MUX(32, 2)
#define SCT0_IN2_PIO1_10 IOPCTL_MUX(42, 1)
#define SCT0_IN2_PIO1_18 IOPCTL_MUX(50, 2)
#define SCT0_IN2_PIO1_20 IOPCTL_MUX(52, 2)
#define SCT0_IN2_PIO1_22 IOPCTL_MUX(54, 2)
#define SCT0_IN2_PIO1_24 IOPCTL_MUX(56, 2)
#define SCT0_IN2_PIO1_26 IOPCTL_MUX(58, 2)
#define SCT0_IN2_PIO1_28 IOPCTL_MUX(60, 2)
#define SCT0_IN2_PIO1_30 IOPCTL_MUX(62, 2)
#define SCT0_IN2_PIO1_31 IOPCTL_MUX(63, 2)
#define SCT0_IN2_PIO1_6 IOPCTL_MUX(38, 2)
#define SCT0_IN2_PIO1_7 IOPCTL_MUX(39, 2)
#define SCT0_IN2_PIO2_0 IOPCTL_MUX(64, 2)
#define SCT0_IN2_PIO2_1 IOPCTL_MUX(65, 2)
#define SCT0_IN2_PIO2_10 IOPCTL_MUX(74, 2)
#define SCT0_IN2_PIO2_11 IOPCTL_MUX(75, 2)
#define SCT0_IN2_PIO2_6 IOPCTL_MUX(70, 2)
#define SCT0_IN2_PIO2_7 IOPCTL_MUX(71, 2)
#define SCT0_IN2_PIO3_19 IOPCTL_MUX(115, 5)
#define SCT0_IN3_PIO0_10 IOPCTL_MUX(10, 2)
#define SCT0_IN3_PIO0_11 IOPCTL_MUX(11, 2)
#define SCT0_IN3_PIO0_12 IOPCTL_MUX(12, 2)
#define SCT0_IN3_PIO0_13 IOPCTL_MUX(13, 2)
#define SCT0_IN3_PIO0_14 IOPCTL_MUX(14, 2)
#define SCT0_IN3_PIO0_15 IOPCTL_MUX(15, 2)
#define SCT0_IN3_PIO0_16 IOPCTL_MUX(16, 2)
#define SCT0_IN3_PIO0_17 IOPCTL_MUX(17, 2)
#define SCT0_IN3_PIO0_18 IOPCTL_MUX(18, 2)
#define SCT0_IN3_PIO0_19 IOPCTL_MUX(19, 2)
#define SCT0_IN3_PIO0_31 IOPCTL_MUX(31, 2)
#define SCT0_IN3_PIO0_5 IOPCTL_MUX(5, 2)
#define SCT0_IN3_PIO0_6 IOPCTL_MUX(6, 2)
#define SCT0_IN3_PIO0_7 IOPCTL_MUX(7, 2)
#define SCT0_IN3_PIO0_8 IOPCTL_MUX(8, 2)
#define SCT0_IN3_PIO0_9 IOPCTL_MUX(9, 2)
#define SCT0_IN3_PIO1_0 IOPCTL_MUX(32, 2)
#define SCT0_IN3_PIO1_10 IOPCTL_MUX(42, 1)
#define SCT0_IN3_PIO1_18 IOPCTL_MUX(50, 2)
#define SCT0_IN3_PIO1_20 IOPCTL_MUX(52, 2)
#define SCT0_IN3_PIO1_22 IOPCTL_MUX(54, 2)
#define SCT0_IN3_PIO1_24 IOPCTL_MUX(56, 2)
#define SCT0_IN3_PIO1_26 IOPCTL_MUX(58, 2)
#define SCT0_IN3_PIO1_28 IOPCTL_MUX(60, 2)
#define SCT0_IN3_PIO1_30 IOPCTL_MUX(62, 2)
#define SCT0_IN3_PIO1_31 IOPCTL_MUX(63, 2)
#define SCT0_IN3_PIO1_6 IOPCTL_MUX(38, 2)
#define SCT0_IN3_PIO1_7 IOPCTL_MUX(39, 2)
#define SCT0_IN3_PIO2_0 IOPCTL_MUX(64, 2)
#define SCT0_IN3_PIO2_1 IOPCTL_MUX(65, 2)
#define SCT0_IN3_PIO2_10 IOPCTL_MUX(74, 2)
#define SCT0_IN3_PIO2_11 IOPCTL_MUX(75, 2)
#define SCT0_IN3_PIO2_6 IOPCTL_MUX(70, 2)
#define SCT0_IN3_PIO2_7 IOPCTL_MUX(71, 2)
#define SCT0_IN3_PIO3_19 IOPCTL_MUX(115, 5)
#define SCT0_IN4_PIO0_10 IOPCTL_MUX(10, 2)
#define SCT0_IN4_PIO0_11 IOPCTL_MUX(11, 2)
#define SCT0_IN4_PIO0_12 IOPCTL_MUX(12, 2)
#define SCT0_IN4_PIO0_13 IOPCTL_MUX(13, 2)
#define SCT0_IN4_PIO0_14 IOPCTL_MUX(14, 2)
#define SCT0_IN4_PIO0_15 IOPCTL_MUX(15, 2)
#define SCT0_IN4_PIO0_16 IOPCTL_MUX(16, 2)
#define SCT0_IN4_PIO0_17 IOPCTL_MUX(17, 2)
#define SCT0_IN4_PIO0_18 IOPCTL_MUX(18, 2)
#define SCT0_IN4_PIO0_19 IOPCTL_MUX(19, 2)
#define SCT0_IN4_PIO0_31 IOPCTL_MUX(31, 2)
#define SCT0_IN4_PIO0_5 IOPCTL_MUX(5, 2)
#define SCT0_IN4_PIO0_6 IOPCTL_MUX(6, 2)
#define SCT0_IN4_PIO0_7 IOPCTL_MUX(7, 2)
#define SCT0_IN4_PIO0_8 IOPCTL_MUX(8, 2)
#define SCT0_IN4_PIO0_9 IOPCTL_MUX(9, 2)
#define SCT0_IN4_PIO1_0 IOPCTL_MUX(32, 2)
#define SCT0_IN4_PIO1_10 IOPCTL_MUX(42, 1)
#define SCT0_IN4_PIO1_18 IOPCTL_MUX(50, 2)
#define SCT0_IN4_PIO1_20 IOPCTL_MUX(52, 2)
#define SCT0_IN4_PIO1_22 IOPCTL_MUX(54, 2)
#define SCT0_IN4_PIO1_24 IOPCTL_MUX(56, 2)
#define SCT0_IN4_PIO1_26 IOPCTL_MUX(58, 2)
#define SCT0_IN4_PIO1_28 IOPCTL_MUX(60, 2)
#define SCT0_IN4_PIO1_30 IOPCTL_MUX(62, 2)
#define SCT0_IN4_PIO1_31 IOPCTL_MUX(63, 2)
#define SCT0_IN4_PIO1_6 IOPCTL_MUX(38, 2)
#define SCT0_IN4_PIO1_7 IOPCTL_MUX(39, 2)
#define SCT0_IN4_PIO2_0 IOPCTL_MUX(64, 2)
#define SCT0_IN4_PIO2_1 IOPCTL_MUX(65, 2)
#define SCT0_IN4_PIO2_10 IOPCTL_MUX(74, 2)
#define SCT0_IN4_PIO2_11 IOPCTL_MUX(75, 2)
#define SCT0_IN4_PIO2_6 IOPCTL_MUX(70, 2)
#define SCT0_IN4_PIO2_7 IOPCTL_MUX(71, 2)
#define SCT0_IN4_PIO3_19 IOPCTL_MUX(115, 5)
#define SCT0_IN5_PIO0_10 IOPCTL_MUX(10, 2)
#define SCT0_IN5_PIO0_11 IOPCTL_MUX(11, 2)
#define SCT0_IN5_PIO0_12 IOPCTL_MUX(12, 2)
#define SCT0_IN5_PIO0_13 IOPCTL_MUX(13, 2)
#define SCT0_IN5_PIO0_14 IOPCTL_MUX(14, 2)
#define SCT0_IN5_PIO0_15 IOPCTL_MUX(15, 2)
#define SCT0_IN5_PIO0_16 IOPCTL_MUX(16, 2)
#define SCT0_IN5_PIO0_17 IOPCTL_MUX(17, 2)
#define SCT0_IN5_PIO0_18 IOPCTL_MUX(18, 2)
#define SCT0_IN5_PIO0_19 IOPCTL_MUX(19, 2)
#define SCT0_IN5_PIO0_31 IOPCTL_MUX(31, 2)
#define SCT0_IN5_PIO0_5 IOPCTL_MUX(5, 2)
#define SCT0_IN5_PIO0_6 IOPCTL_MUX(6, 2)
#define SCT0_IN5_PIO0_7 IOPCTL_MUX(7, 2)
#define SCT0_IN5_PIO0_8 IOPCTL_MUX(8, 2)
#define SCT0_IN5_PIO0_9 IOPCTL_MUX(9, 2)
#define SCT0_IN5_PIO1_0 IOPCTL_MUX(32, 2)
#define SCT0_IN5_PIO1_10 IOPCTL_MUX(42, 1)
#define SCT0_IN5_PIO1_18 IOPCTL_MUX(50, 2)
#define SCT0_IN5_PIO1_20 IOPCTL_MUX(52, 2)
#define SCT0_IN5_PIO1_22 IOPCTL_MUX(54, 2)
#define SCT0_IN5_PIO1_24 IOPCTL_MUX(56, 2)
#define SCT0_IN5_PIO1_26 IOPCTL_MUX(58, 2)
#define SCT0_IN5_PIO1_28 IOPCTL_MUX(60, 2)
#define SCT0_IN5_PIO1_30 IOPCTL_MUX(62, 2)
#define SCT0_IN5_PIO1_31 IOPCTL_MUX(63, 2)
#define SCT0_IN5_PIO1_6 IOPCTL_MUX(38, 2)
#define SCT0_IN5_PIO1_7 IOPCTL_MUX(39, 2)
#define SCT0_IN5_PIO2_0 IOPCTL_MUX(64, 2)
#define SCT0_IN5_PIO2_1 IOPCTL_MUX(65, 2)
#define SCT0_IN5_PIO2_10 IOPCTL_MUX(74, 2)
#define SCT0_IN5_PIO2_11 IOPCTL_MUX(75, 2)
#define SCT0_IN5_PIO2_6 IOPCTL_MUX(70, 2)
#define SCT0_IN5_PIO2_7 IOPCTL_MUX(71, 2)
#define SCT0_IN5_PIO3_19 IOPCTL_MUX(115, 5)
#define SCT0_IN6_PIO0_10 IOPCTL_MUX(10, 2)
#define SCT0_IN6_PIO0_11 IOPCTL_MUX(11, 2)
#define SCT0_IN6_PIO0_12 IOPCTL_MUX(12, 2)
#define SCT0_IN6_PIO0_13 IOPCTL_MUX(13, 2)
#define SCT0_IN6_PIO0_14 IOPCTL_MUX(14, 2)
#define SCT0_IN6_PIO0_15 IOPCTL_MUX(15, 2)
#define SCT0_IN6_PIO0_16 IOPCTL_MUX(16, 2)
#define SCT0_IN6_PIO0_17 IOPCTL_MUX(17, 2)
#define SCT0_IN6_PIO0_18 IOPCTL_MUX(18, 2)
#define SCT0_IN6_PIO0_19 IOPCTL_MUX(19, 2)
#define SCT0_IN6_PIO0_31 IOPCTL_MUX(31, 2)
#define SCT0_IN6_PIO0_5 IOPCTL_MUX(5, 2)
#define SCT0_IN6_PIO0_6 IOPCTL_MUX(6, 2)
#define SCT0_IN6_PIO0_7 IOPCTL_MUX(7, 2)
#define SCT0_IN6_PIO0_8 IOPCTL_MUX(8, 2)
#define SCT0_IN6_PIO0_9 IOPCTL_MUX(9, 2)
#define SCT0_IN6_PIO1_0 IOPCTL_MUX(32, 2)
#define SCT0_IN6_PIO1_10 IOPCTL_MUX(42, 1)
#define SCT0_IN6_PIO1_18 IOPCTL_MUX(50, 2)
#define SCT0_IN6_PIO1_20 IOPCTL_MUX(52, 2)
#define SCT0_IN6_PIO1_22 IOPCTL_MUX(54, 2)
#define SCT0_IN6_PIO1_24 IOPCTL_MUX(56, 2)
#define SCT0_IN6_PIO1_26 IOPCTL_MUX(58, 2)
#define SCT0_IN6_PIO1_28 IOPCTL_MUX(60, 2)
#define SCT0_IN6_PIO1_30 IOPCTL_MUX(62, 2)
#define SCT0_IN6_PIO1_31 IOPCTL_MUX(63, 2)
#define SCT0_IN6_PIO1_6 IOPCTL_MUX(38, 2)
#define SCT0_IN6_PIO1_7 IOPCTL_MUX(39, 2)
#define SCT0_IN6_PIO2_0 IOPCTL_MUX(64, 2)
#define SCT0_IN6_PIO2_1 IOPCTL_MUX(65, 2)
#define SCT0_IN6_PIO2_10 IOPCTL_MUX(74, 2)
#define SCT0_IN6_PIO2_11 IOPCTL_MUX(75, 2)
#define SCT0_IN6_PIO2_6 IOPCTL_MUX(70, 2)
#define SCT0_IN6_PIO2_7 IOPCTL_MUX(71, 2)
#define SCT0_IN6_PIO3_19 IOPCTL_MUX(115, 5)
#define SCT0_OUT0_PIO0_14 IOPCTL_MUX(14, 3)
#define SCT0_OUT0_PIO0_5 IOPCTL_MUX(5, 3)
#define SCT0_OUT0_PIO1_19 IOPCTL_MUX(51, 2)
#define SCT0_OUT0_PIO2_2 IOPCTL_MUX(66, 2)
#define SCT0_OUT0_PIO2_29 IOPCTL_MUX(93, 2)
#define SCT0_OUT1_PIO0_15 IOPCTL_MUX(15, 3)
#define SCT0_OUT1_PIO0_6 IOPCTL_MUX(6, 3)
#define SCT0_OUT1_PIO1_21 IOPCTL_MUX(53, 2)
#define SCT0_OUT1_PIO2_3 IOPCTL_MUX(67, 2)
#define SCT0_OUT2_PIO0_12 IOPCTL_MUX(12, 3)
#define SCT0_OUT2_PIO0_16 IOPCTL_MUX(16, 3)
#define SCT0_OUT2_PIO1_23 IOPCTL_MUX(55, 2)
#define SCT0_OUT2_PIO2_4 IOPCTL_MUX(68, 2)
#define SCT0_OUT3_PIO0_13 IOPCTL_MUX(13, 3)
#define SCT0_OUT3_PIO0_17 IOPCTL_MUX(17, 3)
#define SCT0_OUT3_PIO1_25 IOPCTL_MUX(57, 2)
#define SCT0_OUT3_PIO2_30 IOPCTL_MUX(94, 2)
#define SCT0_OUT3_PIO2_5 IOPCTL_MUX(69, 2)
#define SCT0_OUT4_PIO0_19 IOPCTL_MUX(19, 3)
#define SCT0_OUT4_PIO0_7 IOPCTL_MUX(7, 3)
#define SCT0_OUT4_PIO1_27 IOPCTL_MUX(59, 2)
#define SCT0_OUT4_PIO1_6 IOPCTL_MUX(38, 3)
#define SCT0_OUT4_PIO2_8 IOPCTL_MUX(72, 2)
#define SCT0_OUT5_PIO0_8 IOPCTL_MUX(8, 3)
#define SCT0_OUT5_PIO1_29 IOPCTL_MUX(61, 2)
#define SCT0_OUT5_PIO1_7 IOPCTL_MUX(39, 3)
#define SCT0_OUT5_PIO2_9 IOPCTL_MUX(73, 2)
#define SCT0_OUT6_PIO0_18 IOPCTL_MUX(18, 3)
#define SCT0_OUT6_PIO0_31 IOPCTL_MUX(31, 3)
#define SCT0_OUT6_PIO0_9 IOPCTL_MUX(9, 3)
#define SCT0_OUT7_PIO0_10 IOPCTL_MUX(10, 3)
#define SCT0_OUT7_PIO1_0 IOPCTL_MUX(32, 3)
#define SCT0_OUT7_PIO2_31 IOPCTL_MUX(95, 2)
#define SCT0_OUT8_PIO0_11 IOPCTL_MUX(11, 3)
#define SCT0_OUT8_PIO2_14 IOPCTL_MUX(78, 2)
#define SCT0_OUT9_PIO2_15 IOPCTL_MUX(79, 2)
#define SD0_CARD_DET_N_PIO2_9 IOPCTL_MUX(73, 1)
#define SD0_CLK_PIO1_30 IOPCTL_MUX(62, 1)
#define SD0_CMD_PIO1_31 IOPCTL_MUX(63, 1)
#define SD0_DS_PIO2_4 IOPCTL_MUX(68, 5)
#define SD0_RESET_N_PIO2_10 IOPCTL_MUX(74, 1)
#define SD0_VOLT_PIO2_11 IOPCTL_MUX(75, 1)
#define SD0_WR_PRT_PIO2_4 IOPCTL_MUX(68, 1)
#define SD1_CARD_DET_N_PIO3_19 IOPCTL_MUX(115, 1)
#define SD1_CLK_PIO3_8 IOPCTL_MUX(104, 1)
#define SD1_CMD_PIO3_9 IOPCTL_MUX(105, 1)
#define SD1_RESET_N_PIO3_20 IOPCTL_MUX(116, 1)
#define SD1_VOLT_PIO3_21 IOPCTL_MUX(117, 1)
#define SD1_WR_PRT_PIO3_14 IOPCTL_MUX(110, 1)
#define SECGPIO_SECPIO00_PIO0_0 IOPCTL_MUX(0, 8)
#define SECGPIO_SECPIO010_PIO0_10 IOPCTL_MUX(10, 8)
#define SECGPIO_SECPIO011_PIO0_11 IOPCTL_MUX(11, 8)
#define SECGPIO_SECPIO012_PIO0_12 IOPCTL_MUX(12, 8)
#define SECGPIO_SECPIO013_PIO0_13 IOPCTL_MUX(13, 8)
#define SECGPIO_SECPIO014_PIO0_14 IOPCTL_MUX(14, 8)
#define SECGPIO_SECPIO015_PIO0_15 IOPCTL_MUX(15, 8)
#define SECGPIO_SECPIO016_PIO0_16 IOPCTL_MUX(16, 8)
#define SECGPIO_SECPIO017_PIO0_17 IOPCTL_MUX(17, 8)
#define SECGPIO_SECPIO018_PIO0_18 IOPCTL_MUX(18, 8)
#define SECGPIO_SECPIO019_PIO0_19 IOPCTL_MUX(19, 8)
#define SECGPIO_SECPIO01_PIO0_1 IOPCTL_MUX(1, 8)
#define SECGPIO_SECPIO021_PIO0_21 IOPCTL_MUX(21, 8)
#define SECGPIO_SECPIO022_PIO0_22 IOPCTL_MUX(22, 8)
#define SECGPIO_SECPIO023_PIO0_23 IOPCTL_MUX(23, 8)
#define SECGPIO_SECPIO024_PIO0_24 IOPCTL_MUX(24, 8)
#define SECGPIO_SECPIO025_PIO0_25 IOPCTL_MUX(25, 8)
#define SECGPIO_SECPIO028_PIO0_28 IOPCTL_MUX(28, 8)
#define SECGPIO_SECPIO029_PIO0_29 IOPCTL_MUX(29, 8)
#define SECGPIO_SECPIO02_PIO0_2 IOPCTL_MUX(2, 8)
#define SECGPIO_SECPIO030_PIO0_30 IOPCTL_MUX(30, 8)
#define SECGPIO_SECPIO031_PIO0_31 IOPCTL_MUX(31, 8)
#define SECGPIO_SECPIO03_PIO0_3 IOPCTL_MUX(3, 8)
#define SECGPIO_SECPIO04_PIO0_4 IOPCTL_MUX(4, 8)
#define SECGPIO_SECPIO05_PIO0_5 IOPCTL_MUX(5, 8)
#define SECGPIO_SECPIO06_PIO0_6 IOPCTL_MUX(6, 8)
#define SECGPIO_SECPIO07_PIO0_7 IOPCTL_MUX(7, 8)
#define SECGPIO_SECPIO08_PIO0_8 IOPCTL_MUX(8, 8)
#define SECGPIO_SECPIO09_PIO0_9 IOPCTL_MUX(9, 8)
#define SWCLK_PIO2_25 IOPCTL_MUX(89, 1)
#define SWDIO_PIO2_26 IOPCTL_MUX(90, 1)
#define SWD_TRACEDATA0_PIO0_22 IOPCTL_MUX(22, 6)
#define SWD_TRACEDATA1_PIO0_23 IOPCTL_MUX(23, 6)
#define SWD_TRACEDATA2_PIO0_24 IOPCTL_MUX(24, 6)
#define SWD_TRACEDATA3_PIO0_25 IOPCTL_MUX(25, 6)
#define SWO_PIO2_24 IOPCTL_MUX(88, 1)
#define SWO_PIO2_31 IOPCTL_MUX(95, 5)
#define TRACECLK_PIO0_21 IOPCTL_MUX(21, 6)
#define USB1_OVERCURRENTN_PIO2_27 IOPCTL_MUX(91, 1)
#define USB1_PORTPWRN_PIO2_28 IOPCTL_MUX(92, 1)
#define USDHC0_USDHC_DATA0_PIO2_0 IOPCTL_MUX(64, 1)
#define USDHC0_USDHC_DATA1_PIO2_1 IOPCTL_MUX(65, 1)
#define USDHC0_USDHC_DATA2_PIO2_2 IOPCTL_MUX(66, 1)
#define USDHC0_USDHC_DATA3_PIO2_3 IOPCTL_MUX(67, 1)
#define USDHC0_USDHC_DATA4_PIO2_5 IOPCTL_MUX(69, 1)
#define USDHC0_USDHC_DATA5_PIO2_6 IOPCTL_MUX(70, 1)
#define USDHC0_USDHC_DATA6_PIO2_7 IOPCTL_MUX(71, 1)
#define USDHC0_USDHC_DATA7_PIO2_8 IOPCTL_MUX(72, 1)
#define USDHC1_USDHC_DATA0_PIO3_10 IOPCTL_MUX(106, 1)
#define USDHC1_USDHC_DATA1_PIO3_11 IOPCTL_MUX(107, 1)
#define USDHC1_USDHC_DATA2_PIO3_12 IOPCTL_MUX(108, 1)
#define USDHC1_USDHC_DATA3_PIO3_13 IOPCTL_MUX(109, 1)
#define USDHC1_USDHC_DATA4_PIO3_15 IOPCTL_MUX(111, 1)
#define USDHC1_USDHC_DATA5_PIO3_16 IOPCTL_MUX(112, 1)
#define USDHC1_USDHC_DATA6_PIO3_17 IOPCTL_MUX(113, 1)
#define USDHC1_USDHC_DATA7_PIO3_18 IOPCTL_MUX(114, 1)
#define UTICK0_CAPTURE0_PIO0_19 IOPCTL_MUX(19, 5)
#define UTICK0_CAPTURE2_PIO1_29 IOPCTL_MUX(61, 3)
#define UTICK0_CAPTURE3_PIO2_31 IOPCTL_MUX(95, 3)
#define ACMP0_ACMP_IN1_PIO2_14 IOPCTL_MUX(78, 0)
#define ACMP0_ACMP_IN2_PIO2_31 IOPCTL_MUX(95, 0)
#define ACMP0_ACMP_IN4_PIO2_15 IOPCTL_MUX(79, 0)
#define ACMP0_ACMP_IN5_PIO3_14 IOPCTL_MUX(110, 0)
#define ADC0_CH6_PIO4_18 IOPCTL_MUX(146, 0)
#define CLKOUT_PIO1_19 IOPCTL_MUX(51, 7)
#define CTIMER0_CAPTURE0_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER0_CAPTURE0_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER0_CAPTURE1_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER0_CAPTURE1_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER0_CAPTURE2_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER0_CAPTURE2_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER0_CAPTURE3_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER0_CAPTURE3_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER0_MATCH3_PIO0_23 IOPCTL_MUX(23, 5)
#define CTIMER1_CAPTURE0_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER1_CAPTURE0_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER1_CAPTURE1_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER1_CAPTURE1_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER1_CAPTURE2_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER1_CAPTURE2_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER1_CAPTURE3_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER1_CAPTURE3_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER2_CAPTURE0_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER2_CAPTURE0_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER2_CAPTURE1_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER2_CAPTURE1_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER2_CAPTURE2_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER2_CAPTURE2_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER2_CAPTURE3_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER2_CAPTURE3_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER3_CAPTURE0_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER3_CAPTURE0_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER3_CAPTURE1_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER3_CAPTURE1_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER3_CAPTURE2_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER3_CAPTURE2_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER3_CAPTURE3_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER3_CAPTURE3_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER4_CAPTURE0_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER4_CAPTURE0_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER4_CAPTURE1_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER4_CAPTURE1_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER4_CAPTURE2_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER4_CAPTURE2_PIO0_22 IOPCTL_MUX(22, 5)
#define CTIMER4_CAPTURE3_PIO0_21 IOPCTL_MUX(21, 5)
#define CTIMER4_CAPTURE3_PIO0_22 IOPCTL_MUX(22, 5)
#define DBI_CSX_PIO4_20 IOPCTL_MUX(148, 1)
#define DBI_DSX_PIO4_21 IOPCTL_MUX(149, 1)
#define DBI_E_PIO4_25 IOPCTL_MUX(153, 1)
#define DBI_RWDX_PIO4_23 IOPCTL_MUX(151, 1)
#define DBI_WRX_PIO4_24 IOPCTL_MUX(152, 1)
#define DMA0_TRIG33_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA0_TRIG33_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA0_TRIG33_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA0_TRIG33_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA0_TRIG33_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA0_TRIG33_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA0_TRIG33_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA0_TRIG33_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA0_TRIG33_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA0_TRIG33_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA0_TRIG33_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA0_TRIG33_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA0_TRIG33_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA0_TRIG33_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA0_TRIG33_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA0_TRIG33_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA0_TRIG33_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA0_TRIG33_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA0_TRIG33_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA0_TRIG33_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA0_TRIG33_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA0_TRIG33_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA0_TRIG33_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA0_TRIG33_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA0_TRIG33_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA0_TRIG33_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA0_TRIG33_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA0_TRIG33_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA0_TRIG33_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA0_TRIG33_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA0_TRIG33_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA0_TRIG33_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA0_TRIG33_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA0_TRIG33_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA0_TRIG33_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA0_TRIG33_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA0_TRIG33_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA0_TRIG33_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA0_TRIG33_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA0_TRIG33_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA0_TRIG33_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA0_TRIG33_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA0_TRIG33_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA0_TRIG33_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA0_TRIG33_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA0_TRIG33_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA0_TRIG33_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA0_TRIG33_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA0_TRIG33_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA0_TRIG33_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA0_TRIG33_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA0_TRIG33_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA0_TRIG33_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA0_TRIG33_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA0_TRIG33_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA0_TRIG34_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA0_TRIG34_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA0_TRIG34_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA0_TRIG34_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA0_TRIG34_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA0_TRIG34_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA0_TRIG34_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA0_TRIG34_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA0_TRIG34_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA0_TRIG34_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA0_TRIG34_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA0_TRIG34_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA0_TRIG34_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA0_TRIG34_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA0_TRIG34_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA0_TRIG34_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA0_TRIG34_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA0_TRIG34_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA0_TRIG34_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA0_TRIG34_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA0_TRIG34_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA0_TRIG34_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA0_TRIG34_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA0_TRIG34_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA0_TRIG34_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA0_TRIG34_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA0_TRIG34_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA0_TRIG34_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA0_TRIG34_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA0_TRIG34_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA0_TRIG34_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA0_TRIG34_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA0_TRIG34_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA0_TRIG34_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA0_TRIG34_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA0_TRIG34_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA0_TRIG34_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA0_TRIG34_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA0_TRIG34_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA0_TRIG34_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA0_TRIG34_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA0_TRIG34_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA0_TRIG34_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA0_TRIG34_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA0_TRIG34_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA0_TRIG34_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA0_TRIG34_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA0_TRIG34_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA0_TRIG34_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA0_TRIG34_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA0_TRIG34_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA0_TRIG34_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA0_TRIG34_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA0_TRIG34_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA0_TRIG34_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA0_TRIG35_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA0_TRIG35_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA0_TRIG35_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA0_TRIG35_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA0_TRIG35_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA0_TRIG35_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA0_TRIG35_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA0_TRIG35_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA0_TRIG35_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA0_TRIG35_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA0_TRIG35_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA0_TRIG35_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA0_TRIG35_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA0_TRIG35_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA0_TRIG35_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA0_TRIG35_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA0_TRIG35_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA0_TRIG35_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA0_TRIG35_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA0_TRIG35_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA0_TRIG35_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA0_TRIG35_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA0_TRIG35_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA0_TRIG35_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA0_TRIG35_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA0_TRIG35_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA0_TRIG35_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA0_TRIG35_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA0_TRIG35_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA0_TRIG35_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA0_TRIG35_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA0_TRIG35_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA0_TRIG35_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA0_TRIG35_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA0_TRIG35_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA0_TRIG35_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA0_TRIG35_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA0_TRIG35_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA0_TRIG35_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA0_TRIG35_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA0_TRIG35_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA0_TRIG35_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA0_TRIG35_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA0_TRIG35_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA0_TRIG35_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA0_TRIG35_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA0_TRIG35_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA0_TRIG35_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA0_TRIG35_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA0_TRIG35_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA0_TRIG35_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA0_TRIG35_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA0_TRIG35_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA0_TRIG35_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA0_TRIG35_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA0_TRIG36_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA0_TRIG36_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA0_TRIG36_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA0_TRIG36_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA0_TRIG36_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA0_TRIG36_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA0_TRIG36_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA0_TRIG36_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA0_TRIG36_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA0_TRIG36_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA0_TRIG36_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA0_TRIG36_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA0_TRIG36_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA0_TRIG36_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA0_TRIG36_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA0_TRIG36_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA0_TRIG36_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA0_TRIG36_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA0_TRIG36_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA0_TRIG36_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA0_TRIG36_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA0_TRIG36_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA0_TRIG36_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA0_TRIG36_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA0_TRIG36_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA0_TRIG36_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA0_TRIG36_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA0_TRIG36_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA0_TRIG36_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA0_TRIG36_PIO1_0 IOPCTL_MUX(32, 0)
