zephyrproject-rtos/hal_nxp/dts/nxp/imxrt/imxrt5xx/pinctrl/MIMXRT595SFFOC-pinctrl.h
#define DMA0_TRIG36_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA0_TRIG36_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA0_TRIG36_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA0_TRIG36_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA0_TRIG36_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA0_TRIG36_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA0_TRIG36_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA0_TRIG36_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA0_TRIG36_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA0_TRIG36_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA0_TRIG36_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA0_TRIG36_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA0_TRIG36_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA0_TRIG36_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA0_TRIG36_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA0_TRIG36_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA0_TRIG36_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA0_TRIG36_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA0_TRIG36_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA0_TRIG36_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA0_TRIG36_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA0_TRIG36_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA0_TRIG36_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA0_TRIG36_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA0_TRIG36_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG33_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG33_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG33_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG33_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG33_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG33_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG33_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG33_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG33_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG33_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG33_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG33_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG33_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG33_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG33_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG33_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG33_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG33_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG33_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG33_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG33_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG33_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG33_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG33_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG33_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG33_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG33_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG33_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG33_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG33_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG33_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG33_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG33_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG33_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG33_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG33_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG33_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG33_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG33_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG33_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG33_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG33_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG33_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG33_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG33_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG33_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG33_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG33_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG33_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG33_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG33_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG33_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG33_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG33_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG33_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG34_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG34_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG34_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG34_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG34_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG34_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG34_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG34_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG34_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG34_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG34_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG34_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG34_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG34_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG34_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG34_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG34_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG34_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG34_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG34_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG34_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG34_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG34_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG34_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG34_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG34_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG34_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG34_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG34_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG34_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG34_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG34_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG34_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG34_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG34_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG34_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG34_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG34_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG34_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG34_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG34_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG34_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG34_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG34_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG34_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG34_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG34_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG34_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG34_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG34_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG34_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG34_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG34_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG34_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG34_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG35_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG35_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG35_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG35_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG35_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG35_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG35_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG35_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG35_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG35_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG35_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG35_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG35_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG35_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG35_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG35_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG35_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG35_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG35_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG35_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG35_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG35_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG35_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG35_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG35_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG35_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG35_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG35_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG35_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG35_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG35_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG35_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG35_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG35_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG35_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG35_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG35_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG35_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG35_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG35_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG35_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG35_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG35_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG35_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG35_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG35_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG35_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG35_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG35_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG35_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG35_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG35_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG35_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG35_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG35_PIO1_7 IOPCTL_MUX(39, 0)
#define DMA1_TRIG36_PIO0_0 IOPCTL_MUX(0, 0)
#define DMA1_TRIG36_PIO0_1 IOPCTL_MUX(1, 0)
#define DMA1_TRIG36_PIO0_10 IOPCTL_MUX(10, 0)
#define DMA1_TRIG36_PIO0_11 IOPCTL_MUX(11, 0)
#define DMA1_TRIG36_PIO0_12 IOPCTL_MUX(12, 0)
#define DMA1_TRIG36_PIO0_13 IOPCTL_MUX(13, 0)
#define DMA1_TRIG36_PIO0_14 IOPCTL_MUX(14, 0)
#define DMA1_TRIG36_PIO0_15 IOPCTL_MUX(15, 0)
#define DMA1_TRIG36_PIO0_16 IOPCTL_MUX(16, 0)
#define DMA1_TRIG36_PIO0_17 IOPCTL_MUX(17, 0)
#define DMA1_TRIG36_PIO0_18 IOPCTL_MUX(18, 0)
#define DMA1_TRIG36_PIO0_19 IOPCTL_MUX(19, 0)
#define DMA1_TRIG36_PIO0_2 IOPCTL_MUX(2, 0)
#define DMA1_TRIG36_PIO0_21 IOPCTL_MUX(21, 0)
#define DMA1_TRIG36_PIO0_22 IOPCTL_MUX(22, 0)
#define DMA1_TRIG36_PIO0_23 IOPCTL_MUX(23, 0)
#define DMA1_TRIG36_PIO0_24 IOPCTL_MUX(24, 0)
#define DMA1_TRIG36_PIO0_25 IOPCTL_MUX(25, 0)
#define DMA1_TRIG36_PIO0_28 IOPCTL_MUX(28, 0)
#define DMA1_TRIG36_PIO0_29 IOPCTL_MUX(29, 0)
#define DMA1_TRIG36_PIO0_3 IOPCTL_MUX(3, 0)
#define DMA1_TRIG36_PIO0_30 IOPCTL_MUX(30, 0)
#define DMA1_TRIG36_PIO0_31 IOPCTL_MUX(31, 0)
#define DMA1_TRIG36_PIO0_4 IOPCTL_MUX(4, 0)
#define DMA1_TRIG36_PIO0_5 IOPCTL_MUX(5, 0)
#define DMA1_TRIG36_PIO0_6 IOPCTL_MUX(6, 0)
#define DMA1_TRIG36_PIO0_7 IOPCTL_MUX(7, 0)
#define DMA1_TRIG36_PIO0_8 IOPCTL_MUX(8, 0)
#define DMA1_TRIG36_PIO0_9 IOPCTL_MUX(9, 0)
#define DMA1_TRIG36_PIO1_0 IOPCTL_MUX(32, 0)
#define DMA1_TRIG36_PIO1_10 IOPCTL_MUX(42, 0)
#define DMA1_TRIG36_PIO1_11 IOPCTL_MUX(43, 0)
#define DMA1_TRIG36_PIO1_12 IOPCTL_MUX(44, 0)
#define DMA1_TRIG36_PIO1_13 IOPCTL_MUX(45, 0)
#define DMA1_TRIG36_PIO1_14 IOPCTL_MUX(46, 0)
#define DMA1_TRIG36_PIO1_15 IOPCTL_MUX(47, 0)
#define DMA1_TRIG36_PIO1_18 IOPCTL_MUX(50, 0)
#define DMA1_TRIG36_PIO1_19 IOPCTL_MUX(51, 0)
#define DMA1_TRIG36_PIO1_20 IOPCTL_MUX(52, 0)
#define DMA1_TRIG36_PIO1_21 IOPCTL_MUX(53, 0)
#define DMA1_TRIG36_PIO1_22 IOPCTL_MUX(54, 0)
#define DMA1_TRIG36_PIO1_23 IOPCTL_MUX(55, 0)
#define DMA1_TRIG36_PIO1_24 IOPCTL_MUX(56, 0)
#define DMA1_TRIG36_PIO1_25 IOPCTL_MUX(57, 0)
#define DMA1_TRIG36_PIO1_26 IOPCTL_MUX(58, 0)
#define DMA1_TRIG36_PIO1_27 IOPCTL_MUX(59, 0)
#define DMA1_TRIG36_PIO1_28 IOPCTL_MUX(60, 0)
#define DMA1_TRIG36_PIO1_29 IOPCTL_MUX(61, 0)
#define DMA1_TRIG36_PIO1_3 IOPCTL_MUX(35, 0)
#define DMA1_TRIG36_PIO1_30 IOPCTL_MUX(62, 0)
#define DMA1_TRIG36_PIO1_31 IOPCTL_MUX(63, 0)
#define DMA1_TRIG36_PIO1_4 IOPCTL_MUX(36, 0)
#define DMA1_TRIG36_PIO1_5 IOPCTL_MUX(37, 0)
#define DMA1_TRIG36_PIO1_6 IOPCTL_MUX(38, 0)
#define DMA1_TRIG36_PIO1_7 IOPCTL_MUX(39, 0)
#define DMIC0_CLK01_PIO5_4 IOPCTL_MUX(164, 4)
#define DMIC0_CLK23_PIO3_1 IOPCTL_MUX(97, 1)
#define DMIC0_CLK45_PIO3_2 IOPCTL_MUX(98, 1)
#define DMIC0_CLK67_PIO3_3 IOPCTL_MUX(99, 1)
#define DMIC0_DATA01_PIO5_8 IOPCTL_MUX(168, 4)
#define DMIC0_DATA23_PIO3_1 IOPCTL_MUX(97, 2)
#define DMIC0_DATA45_PIO3_2 IOPCTL_MUX(98, 2)
#define DMIC0_DATA67_PIO3_3 IOPCTL_MUX(99, 2)
#define FC10_CTS_SDA_SSELN0_PIO3_11 IOPCTL_MUX(107, 6)
#define FC10_RTS_SCL_SSELN1_PIO3_12 IOPCTL_MUX(108, 6)
#define FC10_RXD_SDA_MOSI_PIO3_10 IOPCTL_MUX(106, 6)
#define FC10_SCK_PIO3_8 IOPCTL_MUX(104, 6)
#define FC10_SSELN2_PIO3_13 IOPCTL_MUX(109, 6)
#define FC10_SSELN3_PIO3_14 IOPCTL_MUX(110, 6)
#define FC10_TXD_SCL_MISO_PIO3_9 IOPCTL_MUX(105, 6)
#define FC11_CTS_SDA_SSELN0_PIO4_23 IOPCTL_MUX(151, 6)
#define FC11_RTS_SCL_SSELN1_PIO4_24 IOPCTL_MUX(152, 6)
#define FC11_RXD_SDA_MOSI_PIO4_22 IOPCTL_MUX(150, 6)
#define FC11_SCK_PIO4_20 IOPCTL_MUX(148, 6)
#define FC11_SSELN2_PIO4_25 IOPCTL_MUX(153, 6)
#define FC11_SSELN3_PIO4_26 IOPCTL_MUX(154, 6)
#define FC11_TXD_SCL_MISO_PIO4_21 IOPCTL_MUX(149, 6)
#define FC12_CTS_SDA_SSELN0_PIO5_0 IOPCTL_MUX(160, 6)
#define FC12_RTS_SCL_SSELN1_PIO5_1 IOPCTL_MUX(161, 6)
#define FC12_RXD_SDA_MOSI_PIO4_31 IOPCTL_MUX(159, 6)
#define FC12_SCK_PIO4_29 IOPCTL_MUX(157, 6)
#define FC12_SSELN2_PIO5_2 IOPCTL_MUX(162, 6)
#define FC12_SSELN3_PIO5_3 IOPCTL_MUX(163, 6)
#define FC12_TXD_SCL_MISO_PIO4_30 IOPCTL_MUX(158, 6)
#define FC1_RXD_SDA_MOSI_DATA_PIO4_6 IOPCTL_MUX(134, 5)
#define FC1_SCK_PIO4_4 IOPCTL_MUX(132, 5)
#define FC1_TXD_SCL_MISO_WS_PIO4_5 IOPCTL_MUX(133, 5)
#define FC2_CTS_SDA_SSEL0_PIO4_14 IOPCTL_MUX(142, 1)
#define FC2_RTS_SCL_SSEL1_PIO4_15 IOPCTL_MUX(143, 1)
#define FC2_RXD_SDA_MOSI_DATA_PIO4_13 IOPCTL_MUX(141, 1)
#define FC2_SCK_PIO4_11 IOPCTL_MUX(139, 1)
#define FC2_SSEL2_PIO4_16 IOPCTL_MUX(144, 1)
#define FC2_SSEL3_PIO4_17 IOPCTL_MUX(145, 1)
#define FC2_TXD_SCL_MISO_WS_PIO4_12 IOPCTL_MUX(140, 1)
#define FC4_CTS_SDA_SSEL0_PIO5_15 IOPCTL_MUX(175, 4)
#define FC4_RTS_SCL_SSEL1_PIO5_16 IOPCTL_MUX(176, 4)
#define FC4_SSEL2_PIO5_17 IOPCTL_MUX(177, 4)
#define FC4_SSEL3_PIO5_18 IOPCTL_MUX(178, 4)
#define FC8_CTS_SDA_SSEL0_PIO2_8 IOPCTL_MUX(72, 5)
#define FC8_CTS_SDA_SSEL1_PIO2_9 IOPCTL_MUX(73, 5)
#define FC8_RXD_SDA_MOSI_DATA_PIO2_7 IOPCTL_MUX(71, 5)
#define FC8_SCK_PIO2_5 IOPCTL_MUX(69, 5)
#define FC8_SSEL2_PIO2_10 IOPCTL_MUX(74, 5)
#define FC8_SSEL3_PIO2_11 IOPCTL_MUX(75, 5)
#define FC8_TXD_SCL_MISO_WS_PIO2_6 IOPCTL_MUX(70, 5)
#define FLEXIO0_IO0_PIO4_20 IOPCTL_MUX(148, 8)
#define FLEXIO0_IO10_PIO4_30 IOPCTL_MUX(158, 8)
#define FLEXIO0_IO11_PIO4_31 IOPCTL_MUX(159, 8)
#define FLEXIO0_IO12_PIO5_0 IOPCTL_MUX(160, 8)
#define FLEXIO0_IO13_PIO5_1 IOPCTL_MUX(161, 8)
#define FLEXIO0_IO14_PIO5_2 IOPCTL_MUX(162, 8)
#define FLEXIO0_IO15_PIO5_3 IOPCTL_MUX(163, 8)
#define FLEXIO0_IO1_PIO4_21 IOPCTL_MUX(149, 8)
#define FLEXIO0_IO2_PIO4_22 IOPCTL_MUX(150, 8)
#define FLEXIO0_IO3_PIO4_23 IOPCTL_MUX(151, 8)
#define FLEXIO0_IO4_PIO4_24 IOPCTL_MUX(152, 8)
#define FLEXIO0_IO5_PIO4_25 IOPCTL_MUX(153, 8)
#define FLEXIO0_IO6_PIO4_26 IOPCTL_MUX(154, 8)
#define FLEXIO0_IO7_PIO4_27 IOPCTL_MUX(155, 8)
#define FLEXIO0_IO8_PIO4_28 IOPCTL_MUX(156, 8)
#define FLEXIO0_IO9_PIO4_29 IOPCTL_MUX(157, 8)
#define FLEXIO0_TRIG0_PIO0_4 IOPCTL_MUX(4, 4)
#define FLEXIO0_TRIG0_PIO3_12 IOPCTL_MUX(108, 4)
#define FLEXIO0_TRIG1_PIO0_5 IOPCTL_MUX(5, 4)
#define FLEXIO0_TRIG1_PIO2_14 IOPCTL_MUX(78, 4)
#define FLEXIO0_TRIG1_PIO3_13 IOPCTL_MUX(109, 4)
#define FLEXIO0_TRIG2_PIO0_11 IOPCTL_MUX(11, 4)
#define FLEXIO0_TRIG3_PIO0_12 IOPCTL_MUX(12, 4)
#define FLEXSPI0_DATA0_PIO1_20 IOPCTL_MUX(52, 1)
#define FLEXSPI0_DATA1_PIO1_21 IOPCTL_MUX(53, 1)
#define FLEXSPI0_DATA2_PIO1_22 IOPCTL_MUX(54, 1)
#define FLEXSPI0_DATA3_PIO1_23 IOPCTL_MUX(55, 1)
#define FLEXSPI0_DATA4_PIO1_24 IOPCTL_MUX(56, 1)
#define FLEXSPI0_DATA5_PIO1_25 IOPCTL_MUX(57, 1)
#define FLEXSPI0_DATA6_PIO1_26 IOPCTL_MUX(58, 1)
#define FLEXSPI0_DATA7_PIO1_27 IOPCTL_MUX(59, 1)
#define FLEXSPI0_DQS_PIO1_28 IOPCTL_MUX(60, 1)
#define FLEXSPI0_SCLK_N_PIO1_29 IOPCTL_MUX(61, 5)
#define FLEXSPI0_SCLK_PIO1_18 IOPCTL_MUX(50, 1)
#define FLEXSPI0_SS0_N_PIO1_19 IOPCTL_MUX(51, 1)
#define FLEXSPI0_SS1_N_PIO1_29 IOPCTL_MUX(61, 1)
#define FLEXSPI1_DATA0_PIO4_12 IOPCTL_MUX(140, 2)
#define FLEXSPI1_DATA1_PIO4_13 IOPCTL_MUX(141, 2)
#define FLEXSPI1_DATA2_PIO4_14 IOPCTL_MUX(142, 2)
#define FLEXSPI1_DATA3_PIO4_15 IOPCTL_MUX(143, 2)
#define FLEXSPI1_DATA4_PIO5_15 IOPCTL_MUX(175, 2)
#define FLEXSPI1_DATA5_PIO5_16 IOPCTL_MUX(176, 2)
#define FLEXSPI1_DATA6_PIO5_17 IOPCTL_MUX(177, 2)
#define FLEXSPI1_DATA7_PIO5_18 IOPCTL_MUX(178, 2)
#define FLEXSPI1_DQS_PIO4_16 IOPCTL_MUX(144, 2)
#define FLEXSPI1_SCLK_N_PIO4_17 IOPCTL_MUX(145, 3)
#define FLEXSPI1_SCLK_PIO4_11 IOPCTL_MUX(139, 2)
#define FLEXSPI1_SS0_N_PIO4_18 IOPCTL_MUX(146, 2)
#define FLEXSPI1_SS1_N_PIO4_17 IOPCTL_MUX(145, 2)
#define GPIO_PIO411_PIO4_11 IOPCTL_MUX(139, 0)
#define GPIO_PIO412_PIO4_12 IOPCTL_MUX(140, 0)
#define GPIO_PIO413_PIO4_13 IOPCTL_MUX(141, 0)
#define GPIO_PIO414_PIO4_14 IOPCTL_MUX(142, 0)
#define GPIO_PIO415_PIO4_15 IOPCTL_MUX(143, 0)
#define GPIO_PIO416_PIO4_16 IOPCTL_MUX(144, 0)
#define GPIO_PIO417_PIO4_17 IOPCTL_MUX(145, 0)
#define GPIO_PIO418_PIO4_18 IOPCTL_MUX(146, 0)
#define GPIO_PIO420_PIO4_20 IOPCTL_MUX(148, 0)
#define GPIO_PIO421_PIO4_21 IOPCTL_MUX(149, 0)
#define GPIO_PIO422_PIO4_22 IOPCTL_MUX(150, 0)
#define GPIO_PIO423_PIO4_23 IOPCTL_MUX(151, 0)
#define GPIO_PIO424_PIO4_24 IOPCTL_MUX(152, 0)
#define GPIO_PIO425_PIO4_25 IOPCTL_MUX(153, 0)
#define GPIO_PIO426_PIO4_26 IOPCTL_MUX(154, 0)
#define GPIO_PIO427_PIO4_27 IOPCTL_MUX(155, 0)
#define GPIO_PIO428_PIO4_28 IOPCTL_MUX(156, 0)
#define GPIO_PIO429_PIO4_29 IOPCTL_MUX(157, 0)
#define GPIO_PIO430_PIO4_30 IOPCTL_MUX(158, 0)
#define GPIO_PIO431_PIO4_31 IOPCTL_MUX(159, 0)
#define GPIO_PIO50_PIO5_0 IOPCTL_MUX(160, 0)
#define GPIO_PIO515_PIO5_15 IOPCTL_MUX(175, 0)
#define GPIO_PIO516_PIO5_16 IOPCTL_MUX(176, 0)
#define GPIO_PIO517_PIO5_17 IOPCTL_MUX(177, 0)
#define GPIO_PIO518_PIO5_18 IOPCTL_MUX(178, 0)
#define GPIO_PIO51_PIO5_1 IOPCTL_MUX(161, 0)
#define GPIO_PIO52_PIO5_2 IOPCTL_MUX(162, 0)
#define GPIO_PIO53_PIO5_3 IOPCTL_MUX(163, 0)
#define GPIO_PIO54_PIO5_4 IOPCTL_MUX(164, 0)
#define GPIO_PIO58_PIO5_8 IOPCTL_MUX(168, 0)
#define HS_SPI0_MISO_PIO1_12 IOPCTL_MUX(44, 1)
#define HS_SPI0_MOSI_PIO1_13 IOPCTL_MUX(45, 1)
#define HS_SPI0_SCK_PIO1_11 IOPCTL_MUX(43, 1)
#define HS_SPI0_SSELN0_PIO1_14 IOPCTL_MUX(46, 1)
#define HS_SPI0_SSELN1_PIO1_15 IOPCTL_MUX(47, 1)
#define HS_SPI1_MISO_PIO1_4 IOPCTL_MUX(36, 6)
#define HS_SPI1_MOSI_PIO1_5 IOPCTL_MUX(37, 6)
#define HS_SPI1_SCK_PIO1_3 IOPCTL_MUX(35, 6)
#define HS_SPI1_SSELN0_PIO1_6 IOPCTL_MUX(38, 6)
#define HS_SPI1_SSELN1_PIO1_7 IOPCTL_MUX(39, 6)
#define I3C1_PUR_PIO3_3 IOPCTL_MUX(99, 6)
#define I3C1_SCL_PIO3_1 IOPCTL_MUX(97, 6)
#define I3C1_SDA_PIO3_2 IOPCTL_MUX(98, 6)
#define LCDIF_dbi_data0_PIO4_27 IOPCTL_MUX(155, 2)
#define LCDIF_dbi_data13_PIO5_8 IOPCTL_MUX(168, 2)
#define LCDIF_dbi_data1_PIO4_28 IOPCTL_MUX(156, 2)
#define LCDIF_dbi_data2_PIO4_29 IOPCTL_MUX(157, 2)
#define LCDIF_dbi_data3_PIO4_30 IOPCTL_MUX(158, 2)
#define LCDIF_dbi_data4_PIO4_31 IOPCTL_MUX(159, 2)
#define LCDIF_dbi_data5_PIO5_0 IOPCTL_MUX(160, 2)
#define LCDIF_dbi_data6_PIO5_1 IOPCTL_MUX(161, 2)
#define LCDIF_dbi_data7_PIO5_2 IOPCTL_MUX(162, 2)
#define LCDIF_dbi_data8_PIO5_3 IOPCTL_MUX(163, 2)
#define LCDIF_dbi_data9_PIO5_4 IOPCTL_MUX(164, 2)
#define LCDIF_lcdif_data0_PIO4_27 IOPCTL_MUX(155, 1)
#define LCDIF_lcdif_data10_PIO3_9 IOPCTL_MUX(105, 2)
#define LCDIF_lcdif_data11_PIO3_10 IOPCTL_MUX(106, 2)
#define LCDIF_lcdif_data12_PIO3_11 IOPCTL_MUX(107, 2)
#define LCDIF_lcdif_data13_PIO3_12 IOPCTL_MUX(108, 2)
#define LCDIF_lcdif_data13_PIO5_8 IOPCTL_MUX(168, 1)
#define LCDIF_lcdif_data14_PIO3_13 IOPCTL_MUX(109, 2)
#define LCDIF_lcdif_data15_PIO3_14 IOPCTL_MUX(110, 2)
#define LCDIF_lcdif_data16_PIO3_15 IOPCTL_MUX(111, 2)
#define LCDIF_lcdif_data17_PIO3_16 IOPCTL_MUX(112, 2)
#define LCDIF_lcdif_data18_PIO3_17 IOPCTL_MUX(113, 2)
#define LCDIF_lcdif_data19_PIO3_18 IOPCTL_MUX(114, 2)
#define LCDIF_lcdif_data1_PIO4_28 IOPCTL_MUX(156, 1)
#define LCDIF_lcdif_data20_PIO3_19 IOPCTL_MUX(115, 2)
#define LCDIF_lcdif_data20_PIO5_15 IOPCTL_MUX(175, 1)
#define LCDIF_lcdif_data21_PIO3_20 IOPCTL_MUX(116, 2)
#define LCDIF_lcdif_data21_PIO5_16 IOPCTL_MUX(176, 1)
#define LCDIF_lcdif_data22_PIO3_21 IOPCTL_MUX(117, 2)
#define LCDIF_lcdif_data22_PIO5_17 IOPCTL_MUX(177, 1)
#define LCDIF_lcdif_data23_PIO3_3 IOPCTL_MUX(99, 3)
#define LCDIF_lcdif_data23_PIO5_18 IOPCTL_MUX(178, 1)
#define LCDIF_lcdif_data2_PIO4_29 IOPCTL_MUX(157, 1)
#define LCDIF_lcdif_data3_PIO4_30 IOPCTL_MUX(158, 1)
#define LCDIF_lcdif_data4_PIO4_31 IOPCTL_MUX(159, 1)
#define LCDIF_lcdif_data5_PIO5_0 IOPCTL_MUX(160, 1)
#define LCDIF_lcdif_data6_PIO5_1 IOPCTL_MUX(161, 1)
#define LCDIF_lcdif_data7_PIO5_2 IOPCTL_MUX(162, 1)
#define LCDIF_lcdif_data8_PIO5_3 IOPCTL_MUX(163, 1)
#define LCDIF_lcdif_data9_PIO3_8 IOPCTL_MUX(104, 2)
#define LCDIF_lcdif_data9_PIO5_4 IOPCTL_MUX(164, 1)
#define LCD_DTCLK_PIO4_24 IOPCTL_MUX(152, 2)
#define LCD_ENABLE_PIO4_23 IOPCTL_MUX(151, 2)
#define LCD_HSYNC_PIO4_25 IOPCTL_MUX(153, 2)
#define LCD_VSYNC_PIO4_26 IOPCTL_MUX(154, 1)
#define LOW_FREQ_CLKOUT_N_PIO5_3 IOPCTL_MUX(163, 7)
#define LOW_FREQ_CLKOUT_PIO5_2 IOPCTL_MUX(162, 7)
#define PIN_32KHZ_CLKOUT_PIO2_14 IOPCTL_MUX(78, 7)
#define SCT0_IN0_PIO0_21 IOPCTL_MUX(21, 2)
#define SCT0_IN0_PIO0_22 IOPCTL_MUX(22, 2)
#define SCT0_IN0_PIO0_23 IOPCTL_MUX(23, 2)
#define SCT0_IN0_PIO0_24 IOPCTL_MUX(24, 2)
#define SCT0_IN1_PIO0_21 IOPCTL_MUX(21, 2)
#define SCT0_IN1_PIO0_22 IOPCTL_MUX(22, 2)
#define SCT0_IN1_PIO0_23 IOPCTL_MUX(23, 2)
#define SCT0_IN1_PIO0_24 IOPCTL_MUX(24, 2)
#define SCT0_IN2_PIO0_21 IOPCTL_MUX(21, 2)
#define SCT0_IN2_PIO0_22 IOPCTL_MUX(22, 2)
#define SCT0_IN2_PIO0_23 IOPCTL_MUX(23, 2)
#define SCT0_IN2_PIO0_24 IOPCTL_MUX(24, 2)
#define SCT0_IN3_PIO0_21 IOPCTL_MUX(21, 2)
#define SCT0_IN3_PIO0_22 IOPCTL_MUX(22, 2)
#define SCT0_IN3_PIO0_23 IOPCTL_MUX(23, 2)
#define SCT0_IN3_PIO0_24 IOPCTL_MUX(24, 2)
#define SCT0_IN4_PIO0_21 IOPCTL_MUX(21, 2)
#define SCT0_IN4_PIO0_22 IOPCTL_MUX(22, 2)
#define SCT0_IN4_PIO0_23 IOPCTL_MUX(23, 2)
#define SCT0_IN4_PIO0_24 IOPCTL_MUX(24, 2)
#define SCT0_IN5_PIO0_21 IOPCTL_MUX(21, 2)
#define SCT0_IN5_PIO0_22 IOPCTL_MUX(22, 2)
#define SCT0_IN5_PIO0_23 IOPCTL_MUX(23, 2)
#define SCT0_IN5_PIO0_24 IOPCTL_MUX(24, 2)
#define SCT0_IN6_PIO0_21 IOPCTL_MUX(21, 2)
#define SCT0_IN6_PIO0_22 IOPCTL_MUX(22, 2)
#define SCT0_IN6_PIO0_23 IOPCTL_MUX(23, 2)
#define SCT0_IN6_PIO0_24 IOPCTL_MUX(24, 2)
#define SCT0_OUT5_PIO0_21 IOPCTL_MUX(21, 3)
#define SCT0_OUT6_PIO0_22 IOPCTL_MUX(22, 3)
#define SCT0_OUT8_PIO0_23 IOPCTL_MUX(23, 3)
#define SCT0_OUT9_PIO0_24 IOPCTL_MUX(24, 3)
#define SD1_CARD_DET_N_PIO4_22 IOPCTL_MUX(150, 4)
#define SD1_CLK_PIO4_11 IOPCTL_MUX(139, 4)
#define SD1_CMD_PIO4_12 IOPCTL_MUX(140, 4)
#define SD1_DS_PIO3_14 IOPCTL_MUX(110, 5)
#define SD1_RESET_N_PIO4_23 IOPCTL_MUX(151, 4)
#define SD1_VOLT_PIO4_24 IOPCTL_MUX(152, 4)
#define SD1_WR_PRT_PIO4_17 IOPCTL_MUX(145, 4)
#define SMARTDMA_SMARTDMA_PIO0_PIO2_0 IOPCTL_MUX(64, 15)
#define SMARTDMA_SMARTDMA_PIO10_PIO2_10 IOPCTL_MUX(74, 15)
#define SMARTDMA_SMARTDMA_PIO11_PIO2_11 IOPCTL_MUX(75, 15)
#define SMARTDMA_SMARTDMA_PIO14_PIO2_14 IOPCTL_MUX(78, 15)
#define SMARTDMA_SMARTDMA_PIO15_PIO2_15 IOPCTL_MUX(79, 15)
#define SMARTDMA_SMARTDMA_PIO1_PIO2_1 IOPCTL_MUX(65, 15)
#define SMARTDMA_SMARTDMA_PIO24_PIO2_24 IOPCTL_MUX(88, 15)
#define SMARTDMA_SMARTDMA_PIO25_PIO2_25 IOPCTL_MUX(89, 15)
#define SMARTDMA_SMARTDMA_PIO26_PIO2_26 IOPCTL_MUX(90, 15)
#define SMARTDMA_SMARTDMA_PIO27_PIO2_27 IOPCTL_MUX(91, 15)
#define SMARTDMA_SMARTDMA_PIO28_PIO2_28 IOPCTL_MUX(92, 15)
#define SMARTDMA_SMARTDMA_PIO29_PIO2_29 IOPCTL_MUX(93, 15)
#define SMARTDMA_SMARTDMA_PIO2_PIO2_2 IOPCTL_MUX(66, 15)
#define SMARTDMA_SMARTDMA_PIO30_PIO2_30 IOPCTL_MUX(94, 15)
#define SMARTDMA_SMARTDMA_PIO31_PIO2_31 IOPCTL_MUX(95, 15)
#define SMARTDMA_SMARTDMA_PIO3_PIO2_3 IOPCTL_MUX(67, 15)
#define SMARTDMA_SMARTDMA_PIO4_PIO2_4 IOPCTL_MUX(68, 15)
#define SMARTDMA_SMARTDMA_PIO5_PIO2_5 IOPCTL_MUX(69, 15)
#define SMARTDMA_SMARTDMA_PIO6_PIO2_6 IOPCTL_MUX(70, 15)
#define SMARTDMA_SMARTDMA_PIO7_PIO2_7 IOPCTL_MUX(71, 15)
#define SMARTDMA_SMARTDMA_PIO8_PIO2_8 IOPCTL_MUX(72, 15)
#define SMARTDMA_SMARTDMA_PIO9_PIO2_9 IOPCTL_MUX(73, 15)
#define SMARTDMA_TRIG0_PIO0_0 IOPCTL_MUX(0, 0)
#define SMARTDMA_TRIG0_PIO0_1 IOPCTL_MUX(1, 0)
#define SMARTDMA_TRIG0_PIO0_2 IOPCTL_MUX(2, 0)
#define SMARTDMA_TRIG0_PIO0_3 IOPCTL_MUX(3, 0)
#define SMARTDMA_TRIG0_PIO0_4 IOPCTL_MUX(4, 0)
#define SMARTDMA_TRIG0_PIO0_5 IOPCTL_MUX(5, 0)
#define SMARTDMA_TRIG0_PIO0_6 IOPCTL_MUX(6, 0)
#define SMARTDMA_TRIG0_PIO0_7 IOPCTL_MUX(7, 0)
#define SMARTDMA_TRIG0_PIO1_0 IOPCTL_MUX(32, 0)
#define SMARTDMA_TRIG0_PIO1_3 IOPCTL_MUX(35, 0)
#define SMARTDMA_TRIG0_PIO1_4 IOPCTL_MUX(36, 0)
