zephyrproject-rtos/hal_nxp/dts/nxp/imxrt/imxrt5xx/pinctrl/MIMXRT595SFFOC-pinctrl.h
#define SMARTDMA_TRIG0_PIO1_5 IOPCTL_MUX(37, 0)
#define SMARTDMA_TRIG0_PIO1_6 IOPCTL_MUX(38, 0)
#define SMARTDMA_TRIG0_PIO1_7 IOPCTL_MUX(39, 0)
#define SMARTDMA_TRIG1_PIO0_0 IOPCTL_MUX(0, 0)
#define SMARTDMA_TRIG1_PIO0_1 IOPCTL_MUX(1, 0)
#define SMARTDMA_TRIG1_PIO0_2 IOPCTL_MUX(2, 0)
#define SMARTDMA_TRIG1_PIO0_3 IOPCTL_MUX(3, 0)
#define SMARTDMA_TRIG1_PIO0_4 IOPCTL_MUX(4, 0)
#define SMARTDMA_TRIG1_PIO0_5 IOPCTL_MUX(5, 0)
#define SMARTDMA_TRIG1_PIO0_6 IOPCTL_MUX(6, 0)
#define SMARTDMA_TRIG1_PIO0_7 IOPCTL_MUX(7, 0)
#define SMARTDMA_TRIG1_PIO1_0 IOPCTL_MUX(32, 0)
#define SMARTDMA_TRIG1_PIO1_3 IOPCTL_MUX(35, 0)
#define SMARTDMA_TRIG1_PIO1_4 IOPCTL_MUX(36, 0)
#define SMARTDMA_TRIG1_PIO1_5 IOPCTL_MUX(37, 0)
#define SMARTDMA_TRIG1_PIO1_6 IOPCTL_MUX(38, 0)
#define SMARTDMA_TRIG1_PIO1_7 IOPCTL_MUX(39, 0)
#define SMARTDMA_TRIG2_PIO0_0 IOPCTL_MUX(0, 0)
#define SMARTDMA_TRIG2_PIO0_1 IOPCTL_MUX(1, 0)
#define SMARTDMA_TRIG2_PIO0_2 IOPCTL_MUX(2, 0)
#define SMARTDMA_TRIG2_PIO0_3 IOPCTL_MUX(3, 0)
#define SMARTDMA_TRIG2_PIO0_4 IOPCTL_MUX(4, 0)
#define SMARTDMA_TRIG2_PIO0_5 IOPCTL_MUX(5, 0)
#define SMARTDMA_TRIG2_PIO0_6 IOPCTL_MUX(6, 0)
#define SMARTDMA_TRIG2_PIO0_7 IOPCTL_MUX(7, 0)
#define SMARTDMA_TRIG2_PIO1_0 IOPCTL_MUX(32, 0)
#define SMARTDMA_TRIG2_PIO1_3 IOPCTL_MUX(35, 0)
#define SMARTDMA_TRIG2_PIO1_4 IOPCTL_MUX(36, 0)
#define SMARTDMA_TRIG2_PIO1_5 IOPCTL_MUX(37, 0)
#define SMARTDMA_TRIG2_PIO1_6 IOPCTL_MUX(38, 0)
#define SMARTDMA_TRIG2_PIO1_7 IOPCTL_MUX(39, 0)
#define SMARTDMA_TRIG3_PIO0_0 IOPCTL_MUX(0, 0)
#define SMARTDMA_TRIG3_PIO0_1 IOPCTL_MUX(1, 0)
#define SMARTDMA_TRIG3_PIO0_2 IOPCTL_MUX(2, 0)
#define SMARTDMA_TRIG3_PIO0_3 IOPCTL_MUX(3, 0)
#define SMARTDMA_TRIG3_PIO0_4 IOPCTL_MUX(4, 0)
#define SMARTDMA_TRIG3_PIO0_5 IOPCTL_MUX(5, 0)
#define SMARTDMA_TRIG3_PIO0_6 IOPCTL_MUX(6, 0)
#define SMARTDMA_TRIG3_PIO0_7 IOPCTL_MUX(7, 0)
#define SMARTDMA_TRIG3_PIO1_0 IOPCTL_MUX(32, 0)
#define SMARTDMA_TRIG3_PIO1_3 IOPCTL_MUX(35, 0)
#define SMARTDMA_TRIG3_PIO1_4 IOPCTL_MUX(36, 0)
#define SMARTDMA_TRIG3_PIO1_5 IOPCTL_MUX(37, 0)
#define SMARTDMA_TRIG3_PIO1_6 IOPCTL_MUX(38, 0)
#define SMARTDMA_TRIG3_PIO1_7 IOPCTL_MUX(39, 0)
#define SMARTDMA_TRIG4_PIO0_0 IOPCTL_MUX(0, 0)
#define SMARTDMA_TRIG4_PIO0_1 IOPCTL_MUX(1, 0)
#define SMARTDMA_TRIG4_PIO0_2 IOPCTL_MUX(2, 0)
#define SMARTDMA_TRIG4_PIO0_3 IOPCTL_MUX(3, 0)
#define SMARTDMA_TRIG4_PIO0_4 IOPCTL_MUX(4, 0)
#define SMARTDMA_TRIG4_PIO0_5 IOPCTL_MUX(5, 0)
#define SMARTDMA_TRIG4_PIO0_6 IOPCTL_MUX(6, 0)
#define SMARTDMA_TRIG4_PIO0_7 IOPCTL_MUX(7, 0)
#define SMARTDMA_TRIG4_PIO1_0 IOPCTL_MUX(32, 0)
#define SMARTDMA_TRIG4_PIO1_3 IOPCTL_MUX(35, 0)
#define SMARTDMA_TRIG4_PIO1_4 IOPCTL_MUX(36, 0)
#define SMARTDMA_TRIG4_PIO1_5 IOPCTL_MUX(37, 0)
#define SMARTDMA_TRIG4_PIO1_6 IOPCTL_MUX(38, 0)
#define SMARTDMA_TRIG4_PIO1_7 IOPCTL_MUX(39, 0)
#define SMARTDMA_TRIG5_PIO0_0 IOPCTL_MUX(0, 0)
#define SMARTDMA_TRIG5_PIO0_1 IOPCTL_MUX(1, 0)
#define SMARTDMA_TRIG5_PIO0_2 IOPCTL_MUX(2, 0)
#define SMARTDMA_TRIG5_PIO0_3 IOPCTL_MUX(3, 0)
#define SMARTDMA_TRIG5_PIO0_4 IOPCTL_MUX(4, 0)
#define SMARTDMA_TRIG5_PIO0_5 IOPCTL_MUX(5, 0)
#define SMARTDMA_TRIG5_PIO0_6 IOPCTL_MUX(6, 0)
#define SMARTDMA_TRIG5_PIO0_7 IOPCTL_MUX(7, 0)
#define SMARTDMA_TRIG5_PIO1_0 IOPCTL_MUX(32, 0)
#define SMARTDMA_TRIG5_PIO1_3 IOPCTL_MUX(35, 0)
#define SMARTDMA_TRIG5_PIO1_4 IOPCTL_MUX(36, 0)
#define SMARTDMA_TRIG5_PIO1_5 IOPCTL_MUX(37, 0)
#define SMARTDMA_TRIG5_PIO1_6 IOPCTL_MUX(38, 0)
#define SMARTDMA_TRIG5_PIO1_7 IOPCTL_MUX(39, 0)
#define SMARTDMA_TRIG6_PIO0_0 IOPCTL_MUX(0, 0)
#define SMARTDMA_TRIG6_PIO0_1 IOPCTL_MUX(1, 0)
#define SMARTDMA_TRIG6_PIO0_2 IOPCTL_MUX(2, 0)
#define SMARTDMA_TRIG6_PIO0_3 IOPCTL_MUX(3, 0)
#define SMARTDMA_TRIG6_PIO0_4 IOPCTL_MUX(4, 0)
#define SMARTDMA_TRIG6_PIO0_5 IOPCTL_MUX(5, 0)
#define SMARTDMA_TRIG6_PIO0_6 IOPCTL_MUX(6, 0)
#define SMARTDMA_TRIG6_PIO0_7 IOPCTL_MUX(7, 0)
#define SMARTDMA_TRIG6_PIO1_0 IOPCTL_MUX(32, 0)
#define SMARTDMA_TRIG6_PIO1_3 IOPCTL_MUX(35, 0)
#define SMARTDMA_TRIG6_PIO1_4 IOPCTL_MUX(36, 0)
#define SMARTDMA_TRIG6_PIO1_5 IOPCTL_MUX(37, 0)
#define SMARTDMA_TRIG6_PIO1_6 IOPCTL_MUX(38, 0)
#define SMARTDMA_TRIG6_PIO1_7 IOPCTL_MUX(39, 0)
#define SMARTDMA_TRIG7_PIO0_0 IOPCTL_MUX(0, 0)
#define SMARTDMA_TRIG7_PIO0_1 IOPCTL_MUX(1, 0)
#define SMARTDMA_TRIG7_PIO0_2 IOPCTL_MUX(2, 0)
#define SMARTDMA_TRIG7_PIO0_3 IOPCTL_MUX(3, 0)
#define SMARTDMA_TRIG7_PIO0_4 IOPCTL_MUX(4, 0)
#define SMARTDMA_TRIG7_PIO0_5 IOPCTL_MUX(5, 0)
#define SMARTDMA_TRIG7_PIO0_6 IOPCTL_MUX(6, 0)
#define SMARTDMA_TRIG7_PIO0_7 IOPCTL_MUX(7, 0)
#define SMARTDMA_TRIG7_PIO1_0 IOPCTL_MUX(32, 0)
#define SMARTDMA_TRIG7_PIO1_3 IOPCTL_MUX(35, 0)
#define SMARTDMA_TRIG7_PIO1_4 IOPCTL_MUX(36, 0)
#define SMARTDMA_TRIG7_PIO1_5 IOPCTL_MUX(37, 0)
#define SMARTDMA_TRIG7_PIO1_6 IOPCTL_MUX(38, 0)
#define SMARTDMA_TRIG7_PIO1_7 IOPCTL_MUX(39, 0)
#define SWD_TRACEDATA0_PIO4_24 IOPCTL_MUX(152, 7)
#define SWD_TRACEDATA1_PIO4_25 IOPCTL_MUX(153, 7)
#define SWD_TRACEDATA2_PIO4_26 IOPCTL_MUX(154, 7)
#define SWD_TRACEDATA3_PIO4_27 IOPCTL_MUX(155, 7)
#define TRACECLK_PIO4_23 IOPCTL_MUX(151, 7)
#define USDHC1_USDHC_DATA0_PIO4_13 IOPCTL_MUX(141, 4)
#define USDHC1_USDHC_DATA1_PIO4_14 IOPCTL_MUX(142, 4)
#define USDHC1_USDHC_DATA2_PIO4_15 IOPCTL_MUX(143, 4)
#define USDHC1_USDHC_DATA3_PIO4_16 IOPCTL_MUX(144, 4)
#define USDHC1_USDHC_DATA4_PIO4_18 IOPCTL_MUX(146, 4)
#define USDHC1_USDHC_DATA6_PIO4_20 IOPCTL_MUX(148, 4)
#define USDHC1_USDHC_DATA7_PIO4_21 IOPCTL_MUX(149, 4)

#endif /* _ZEPHYR_DTS_BINDING_MIMXRT595SFFOC_ */
